[
    {
        "name":"Mario",
        "shortname":"Mario_SSB4",
        "tier":"S (5)",
        "bio":"Mario (マリオ, Mario) is a playable character in Super Smash Bros. 4. He was confirmed on June 11th, 2013 during the E3 2013 Nintendo Direct.[1] He was also one of the main subjects of the Developer's Direct for Super Smash Bros. later during E3 2013.[2] He was among the first wave of amiibo figurines for SSB4. Mario is once again voiced by Charles Martinet, who also reprises his long-time role as Luigi, Wario, and Waluigi, albeit mostly with the same voice clips from Super Smash Bros. Brawl. Mario is currently ranked 5th out of 58 characters on the tier list, in the S tier. This is his best tier placement to date and a vast improvement from his 31st out of 38 ranking Brawl (and his original ranking in Melee), where he stood at the top of the bottom tier, as well as the largest tier rise from Brawl. His primary strength is his polarizing frame data; most of his moves come out extremely fast and have relatively low end lag. This results in Mario having one of the best neutral games in Smash 4, as it is difficult to actually punish him. His combo game, while not as versatile compared to Luigi or Sheik, is nevertheless potent, as Mario can rack up damage quickly and reliably, most notoriously with down throw into multiple up tilts. He also has a versatile moveset: a disruptive projectile in his Fireball, a reflection-based and reverse-based move in his Cape, and a decent but niche edgeguarding option with F.L.U.D.D. Mario's shortcomings include his below average range, giving him trouble against characters with long disjointed range such as Cloud and Marth, and his lack of consistent KO set ups. That said, due to his lack of severe weaknesses, as well as one of the lowest technical curves in the game, Mario has been among the most successful characters in tournaments, and amazing results at top level play, with a slew of dedicated mains. However, due to Mario's incredible tournament placings during the summer of 2016, many smashers now view Mario as one of the best characters in the game and possibly deserving of an even higher ranking on the tier list."
    },
    {
        "name":"Luigi",
        "shortname":"Luigi_SSB4",
        "tier":"D (29)",
        "bio":"Luigi (ルイージ, Luigi) is a playable character in Super Smash Bros. 4. As part of Nintendo's Year of Luigi, his return to the series was announced during the Nintendo Direct on August 7th, 2013.[1] Traditionally, Luigi has always been an unlockable character revealed after an installment of Super Smash Bros. had been released. However, SSB4 is the first installment to break that tradition,[1] as he was both revealed before release and is now a starter character. Charles Martinet reprises his role as Luigi's voice actor, albeit through voice clips recycled from Super Smash Bros. Brawl. Luigi is currently ranked 29th out of 58 in the tier list, placing him at the bottom of the D tier and directly in the middle of both the mid-tier and the overall tier list. This is a vast improvement over his placement in Brawl, where he was ranked 28th out of 38 ranking in Brawl, and his best placement in the series since Melee, where he was ranked 13th out of 26. Luigi's most notable strength is the utility of his moveset: his grounded moves have favorable launching angles, which supplement his air game, while he has numerous moves that boast outstanding combo versatility. He also retains his fast attack speed from Brawl, which makes him difficult to punish and gives him a defensive, yet very dangerous air game. Luigi's recovery is also unpredictable and long-distanced, with Green Missile and Luigi Cyclone being risky to intercept. However, Luigi retains his overall slow mobility, with his slow air speed and low traction being the attributes that most significantly hinder his movement, punishment ability and out of shield options. His recovery is also very slow, making edgeguarding detrimental to him. Finally, his range is very limited, which prevents him from racking up damage from a safe distance and making him prone to camping, despite having Fireball as a projectile. Like in previous installments, Luigi tends to run hot-and-cold. While his representation remains average, his results in tournaments are better than ever before, thanks to the efforts of professionals such as Mr. ConCon, Boss, J.Miller, and Elegant."
    },
    {
        "name":"Peach",
        "shortname":"Peach_SSB4",
        "tier":"D (26)",
        "bio":"Peach (ピーチ, Peach) is a playable character in Super Smash Bros. 4. She was confirmed on September 12th, 2013, the day before the 28th anniversary of Super Mario Bros., the landmark NES game in which she debuted. She is among the first wave of compatible amiibo figures. She is voiced by Samantha Kelly with the same voice clips from Super Smash Bros. Brawl. Peach is currently ranked at 26th place out of 58 characters on the tier list. This is a slight improvement from her previous 19th of 38 in Brawl, Peach is in mid tier, while in Brawl, she was placed at the bottom of mid-high tier. Peach's ability to float gives her a uniquely strong air game and allows her to pressure opponents safely; this along with her Vegetable projectiles makes for a good neutral game in most matchups. Peach has great combos and can perform complicated combos with high damage output. She also has surprisingly good KOing ability due mainly to the high knockback of her forward aerial. However, Peach suffers from light weight, slow movement and difficulty landing safely, which can lead to her being overwhelmed by aggressive opponents. While she is viewed as a respectable fighter, her results at top level play are lackluster overall despite multiple dedicated mains including SlayerZ, Umeki, Kie and Samsora. "
    },
    {
        "name":"Bowser",
        "shortname":"Bowser_SSB4",
        "tier":"E(32)",
        "bio":"Bowser (クッパ, Koopa) is a playable character in Super Smash Bros. 4. His return to the series was confirmed on June 11th, 2013 during E3 2013, during which he was one of the main subjects of the Developer Direct for SSB4, as well as the last veteran confirmed during the event.[2] Bowser reuses his voice clips from Super Smash Bros. Brawl, some of which have been edited to sound deeper, as well as new voice clips. Bowser is currently ranked 32nd out of 58 on the tier list, placing him in the E tier. This is a considerable improvement from his placement in Brawl, where he was ranked 33rd out of 38, while being both his highest tier placement in the series to date and the first time he has not been ranked as a bottom-tier character. Many of Bowser's problems have been fixed: he is much more mobile, has much greater range, and has noticeably improved combo and grab games. Alongside his new benefits, he retains his immense endurance, overall high damage output, and very strong KOing options. However, Bowser remains virtually defenseless outside of out of shield Whirling Fortress, as he is very susceptible to combos due to his large size, heavy weight, and lack of combo breakers. This is exacerbated by his lack of good landing options and how his rolls and sidesteps are short both in distance and intangibility duration. Additionally, his recovery is still below average despite its improvements. Bowser's drastic improvements resulted in him achieving many high spots in promotional tournaments held for SSB4. However, his position among the cast is debatable, due to several of his fellow veterans having also been buffed to varying degrees. Despite no longer being plagued by poor mobility and range, Bowser's flaw of being vulnerable to attacks remains intact due to his large hurtbox (which was enlarged even further in the transition to SSB4) and unsafe landing options. Although his perception in the metagame has fluctuated over SSB4's lifespan, Bowser is a relatively viable character as of update 1.1.3, as he has become surprisingly effective for a super heavyweight like how he was perceived in the very early SSB4 metagame, if not to the same extent. Lastly, while Bowser's high-level tournament representation has been rather poor, dedicated players like LordMix have been able to overcome Bowser's limitations and win difficult matchups against high-level players of top-tier characters, such as Vinnie's Rosalina & Luma and VoiD's Sheik."
    },
    {
        "name":"Dr. Mario",
        "shortname":"Dr._Mario_SSB4",
        "tier":"G (48)",
        "bio":"Dr. Mario (Dr. マリオ, Dr. Mario) is a playable character in Super Smash Bros. 4. His return to the series was officially confirmed on October 9th, 2014 as part of a post-release announcement, during which Dark Pit was also confirmed. Like Dark Pit and Lucina, Dr. Mario was originally planned to be an alternate costume. However, all three were instead converted into being clones late in SSB4's development, with Masahiro Sakurai explaining that the reason for doing so in regard to Dr. Mario was in order to appeal to his fanbase from Super Smash Bros. Melee. Dr. Mario is also the first of three Melee characters that were cut from Super Smash Bros. Brawl to return for SSB4, followed by Roy and Mewtwo. However, he retains his status as an unlockable character, whereas Roy and Mewtwo are now downloadable content. Like Mario, Dr. Mario's moveset has very slightly changed since his last appearance; most notably, he now possesses a Final Smash called Doctor Finale. Charles Martinet reprises his role as Dr. Mario's voice actor, albeit via Mario's voice clips from Brawl. Dr. Mario is currently ranked 48th out of 58 on the tier list, placing him in the G tier. This is a vast drop from his placement in Melee, where his ranking of 11th out of 26 placed him in the mid-tier and higher than his normal self. While Dr. Mario's power has increased overall, his mobility has become noticeably slower and less nimble, with these traits having been implemented in order to differentiate him from Mario. Dr. Mario's recovery and combo game are also inferior to Mario's, which altogether have resulted in him having poor representation and below average results in competitive play. Despite his glaring flaws, Dr. Mario has gained status as a niche character in competitive play. This is courtesy of his metagame being expanded by professionals, such as 2ManyCooks, Atomsk and Nairo, who have shown that he can still be an effective choice in certain matchups."
    },
    {
        "name":"Yoshi",
        "shortname":"Yoshi_SSB4",
        "tier":"D (23)",
        "bio":"Yoshi (ヨッシー, Yoshi) is a playable character in Super Smash Bros. 4. His return to the series was confirmed during the April 8th, 2014 Super Smash Bros. Direct, making him the last of the 'perfect-attendance crew' to be announced. Additionally, he was among the first wave of amiibo figures. Yoshi is once again voiced by Kazumi Totaka, albeit via voice clips recycled from earlier installments of Super Smash Bros. as well as every game Yoshi has spoken in since Yoshi's Story. Yoshi is currently ranked 23rd out of 58 on the tier list, placing him at the top of the D tier and making him the highest ranking mid-tier character. This is a vast improvement from his placement in Brawl, where he was ranked 27th out of 38. Yoshi sports a healthy mix of speed and power, as well as impressive aerial mobility for a heavyweight. He boasts the fastest air speed in the game and possesses a double jump which not only grants the most distance out of any double jump in the game, but also grants him armor, all of which make Yoshi difficult to contend with in the air. Another of Yoshi's greatest assets is his Egg Throw, which is an effective and versatile projectile that also aids his recovery and has mindgame potential when b-reversed multiple times. However, Yoshi's grab game is poor due to his grabs being laggy and his throws having little to no utility. His rolls and sidesteps are short-distanced and are among the slowest in the game, making him susceptible to pressure should the opponent close the gap between them. Lastly, Yoshi has very minimal vertical recovery outside of his double jump, making him vulnerable to gimping."
    },
    {
        "name":"Donkey Kong",
        "shortname":"Donkey_Kong_SSB4",
        "tier":"D (25)",
        "bio":"Donkey Kong (ドンキーコング, Donkey Kong) is a playable character in Super Smash Bros. 4. His return to the series was confirmed on June 11th, 2013 during the E3 Nintendo Direct. As in previous installments, Donkey Kong also retains his realistic gorilla grunts, albeit with a new set of voice clips. Donkey Kong is currently ranked 25th out of 58 on the tier list, placing him in the D tier. This makes him the highest ranked super heavyweight and is an improvement from his placement in Brawl, where he was ranked 21st out of 38. Donkey Kong retains his signature power, mobility, and spacing options, with his renowned back aerial remaining a quick and powerful option to stop approaches and deal damage. However, Donkey Kong now boasts great combo potential thanks to his up 'cargo throw', which allows for guaranteed follow-ups at varying percents and even a guaranteed KO combo at a small range of percents. However, Donkey Kong retains many of his flaws from Brawl. His large hurtbox has become even larger, which makes him even more susceptible to combos than before, while his poor vertical recovery continues to render him very susceptible to edgeguarding. Nevertheless, Donkey Kong's advantages generally outweigh his disadvantages, to the point that he has achieved above average results in competitive play, largely thanks to DKwill and Larry Lurr."
    },
    {
        "name":"Diddy Kong",
        "shortname":"Diddy_Kong_SSB4",
        "tier":"S (1)",
        "bio":"Diddy Kong (ディディーコング, Diddy Kong) is a playable character in Super Smash Bros. 4. He was confirmed on February 21st, 2014, coinciding with the international release date of Donkey Kong Country: Tropical Freeze. Diddy Kong retains his realistic chimpanzee screeches from Super Smash Bros. Brawl. Diddy Kong currently rests at 1st out of 58 characters in the tier list, on the S tier, a slight rise from being 4th out of 38 in Brawl. Diddy Kong's strengths lie in his profound comboing ability, with attacks flowing very well together as a result of their surprisingly long reach for a character of his size, quick frame data, and low knockback. He also has a fair share of strong finishers, such as his smash attacks, which he can combo into. He is highly mobile and has a strong neutral game thanks to his Banana Peel and Peanut Popgun. However, Diddy Kong is quite susceptible to being gimped, as Monkey Flip is linear and short-distanced while Rocketbarrel Boost is very unsafe to use from virtually any distance. He also suffers from a poor damage output, exacerbated by his poor aerial mobility when not using special moves, which hinders his aerial combo game. Finally, his Banana Peel, which heavily contributed to his top tier status in Brawl, has reduced stage control potential and is no longer capable of locking or zero-deathing opponents as the active Banana Peel maximum was reduced to one. Still, his strengths generally outshine his flaws, and he has seen some of the best tournament representation and results of any character in spite of being severely nerfed by updates. Despite this, Diddy's tier placement is somewhat debated, as other characters such as Mario have recently been more dominant in competitive play; in particular, Diddy's best player ZeRo no longer shows the same level of dominance as he once did, even in the early days of version 1.1.6."
    },
    {
        "name":"Fox",
        "shortname":"Fox_SSB4",
        "tier":"S (7)",
        "bio":"Fox (フォックス, Fox) returns as a playable character in Super Smash Bros. 4. He was one of the characters confirmed to return in the game during the E3 2013 trailers on June 11th, 2013. He was also among the first wave of amiibo figures that are compatible with SSB4. Kenji Nojima reprises his role as Fox in the Japanese version with re-recorded voice clips. However, Mike West, Fox's original English voice actor who voiced him in Star Fox 64, reprised his role in the 3DS remake, Star Fox 64 3D and in the Wii U title, Star Fox Zero, now once again voices Fox, replacing Jim Walker. Fox is currently ranked 7th out of 58 characters in the tier list, placing him as the lowest ranked S tier and a significant rise from his previous position from Brawl where he was ranked 15th of 38 characters. Fox's strengths include very quick mobility, a fast and transcendent projectile in his Blaster, and an anti-camping move in his Reflector. Altogether, these grant him one of the fastest and safest approaches in the entire game and allow him to easily keep up with almost any opponent. Fox also boasts a versatile combo game thanks to his quick, low knockback moves, along with capable KOing power, with a quick and powerful finisher in his up smash. However, Fox's extremely fast falling speed, very high gravity and light weight make him one of the easiest characters to both combo and KO, making him prone to momentum shifts. His recovery, while long-distanced, is extremely predictable. His grab game is also faulty, as his throws lack utility due to having no follow-ups past medium percentages or being realistic KOing options. The introduction of rage further burdens Fox, as the efficiency of his combos drops dramatically with it, while he becomes even easier to KO. Regardless, Fox's weaknesses are not enough to keep him out of the top tier, which is evident by his high tournament representation (with dedicated mains such as Larry Lurr) and great results."
    }
]