[
    {
        "name":"Mario",
        "picname":"Mario",
        "tier":"S(5)",
        "bio":"Mario (マリオ, Mario) is a playable character in Super Smash Bros. 4. He was confirmed on June 11th, 2013 during the E3 2013 Nintendo Direct.[1] He was also one of the main subjects of the Developer's Direct for Super Smash Bros. later during E3 2013.[2] He was among the first wave of amiibo figurines for SSB4. Mario is once again voiced by Charles Martinet, who also reprises his long-time role as Luigi, Wario, and Waluigi, albeit mostly with the same voice clips from Super Smash Bros. Brawl. Mario is currently ranked 5th out of 58 characters on the tier list, in the S tier. This is his best tier placement to date and a vast improvement from his 31st out of 38 ranking Brawl (and his original ranking in Melee), where he stood at the top of the bottom tier, as well as the largest tier rise from Brawl. His primary strength is his polarizing frame data; most of his moves come out extremely fast and have relatively low end lag. This results in Mario having one of the best neutral games in Smash 4, as it is difficult to actually punish him. His combo game, while not as versatile compared to Luigi, is nevertheless potent, as Mario can rack up damage quickly and reliably, most notoriously with down throw into multiple up tilts. He also has a versatile moveset: a disruptive projectile in his Fireball, a reflection-based and reverse-based move in his Cape, and a decent but niche edgeguarding option with F.L.U.D.D. Mario's shortcomings include his below average range, and his lack of consistent KO set ups. That said, due to his lack of severe weaknesses, as well as one of the lowest technical curves in the game, Mario has been among the most successful characters in tournaments, and amazing results at top level play, with a slew of dedicated mains. However, due to Mario's incredible tournament placings during the summer of 2016, many smashers now view Mario as one of the best characters in the game and possibly deserving of an even higher ranking on the tier list."
    },
    {
        "name":"Luigi",
        "picname":"Luigi",
        "tier":"D(29)",
        "bio":"Luigi (ルイージ, Luigi) is a playable character in Super Smash Bros. 4. As part of Nintendo's Year of Luigi, his return to the series was announced during the Nintendo Direct on August 7th, 2013.[1] Traditionally, Luigi has always been an unlockable character revealed after an installment of Super Smash Bros. had been released. However, SSB4 is the first installment to break that tradition,[1] as he was both revealed before release and is now a starter character. Charles Martinet reprises his role as Luigi's voice actor, albeit through voice clips recycled from Super Smash Bros. Brawl. Luigi is currently ranked 29th out of 58 in the tier list, placing him at the bottom of the D tier and directly in the middle of both the mid-tier and the overall tier list. This is a vast improvement over his placement in Brawl, where he was ranked 28th out of 38 ranking in Brawl, and his best placement in the series since Melee, where he was ranked 13th out of 26. Luigi's most notable strength is the utility of his moveset: his grounded moves have favorable launching angles, which supplement his air game, while he has numerous moves that boast outstanding combo versatility. He also retains his fast attack speed from Brawl, which makes him difficult to punish and gives him a defensive, yet very dangerous air game. Luigi's recovery is also unpredictable and long-distanced, with Green Missile and Luigi Cyclone being risky to intercept. However, Luigi retains his overall slow mobility, with his slow air speed and low traction being the attributes that most significantly hinder his movement, punishment ability and out of shield options. His recovery is also very slow, making edgeguarding detrimental to him. Finally, his range is very limited, which prevents him from racking up damage from a safe distance and making him prone to camping, despite having Fireball as a projectile. Like in previous installments, Luigi tends to run hot-and-cold. While his representation remains average, his results in tournaments are better than ever before, thanks to the efforts of professionals such as Mr. ConCon, Boss, J.Miller, and Elegant."
    },
    {
        "name":"Peach",
        "picname":"Peach",
        "tier":"D(26)",
        "bio":"Peach (ピーチ, Peach) is a playable character in Super Smash Bros. 4. She was confirmed on September 12th, 2013, the day before the 28th anniversary of Super Mario Bros., the landmark NES game in which she debuted. She is among the first wave of compatible amiibo figures. She is voiced by Samantha Kelly with the same voice clips from Super Smash Bros. Brawl. Peach is currently ranked at 26th place out of 58 characters on the tier list. This is a slight improvement from her previous 19th of 38 in Brawl, Peach is in mid tier, while in Brawl, she was placed at the bottom of mid-high tier. Peach's ability to float gives her a uniquely strong air game and allows her to pressure opponents safely; this along with her Vegetable projectiles makes for a good neutral game in most matchups. Peach has great combos and can perform complicated combos with high damage output. She also has surprisingly good KOing ability due mainly to the high knockback of her forward aerial. However, Peach suffers from light weight, slow movement and difficulty landing safely, which can lead to her being overwhelmed by aggressive opponents. While she is viewed as a respectable fighter, her results at top level play are lackluster overall despite multiple dedicated mains including SlayerZ, Umeki, Kie and Samsora. "
    },
    {
        "name":"Bowser",
        "picname":"Bowser",
        "tier":"E(32)",
        "bio":"Bowser (クッパ, Koopa) is a playable character in Super Smash Bros. 4. His return to the series was confirmed on June 11th, 2013 during E3 2013, during which he was one of the main subjects of the Developer Direct for SSB4, as well as the last veteran confirmed during the event.[2] Bowser reuses his voice clips from Super Smash Bros. Brawl, some of which have been edited to sound deeper, as well as new voice clips. Bowser is currently ranked 32nd out of 58 on the tier list, placing him in the E tier. This is a considerable improvement from his placement in Brawl, where he was ranked 33rd out of 38, while being both his highest tier placement in the series to date and the first time he has not been ranked as a bottom-tier character. Many of Bowser's problems have been fixed: he is much more mobile, has much greater range, and has noticeably improved combo and grab games. Alongside his new benefits, he retains his immense endurance, overall high damage output, and very strong KOing options. However, Bowser remains virtually defenseless outside of out of shield Whirling Fortress, as he is very susceptible to combos due to his large size, heavy weight, and lack of combo breakers. This is exacerbated by his lack of good landing options and how his rolls and sidesteps are short both in distance and intangibility duration. Additionally, his recovery is still below average despite its improvements. Bowser's drastic improvements resulted in him achieving many high spots in promotional tournaments held for SSB4. However, his position among the cast is debatable, due to several of his fellow veterans having also been buffed to varying degrees. Despite no longer being plagued by poor mobility and range, Bowser's flaw of being vulnerable to attacks remains intact due to his large hurtbox (which was enlarged even further in the transition to SSB4) and unsafe landing options. Although his perception in the metagame has fluctuated over SSB4's lifespan, Bowser is a relatively viable character as of update 1.1.3, as he has become surprisingly effective for a super heavyweight like how he was perceived in the very early SSB4 metagame, if not to the same extent. Lastly, while Bowser's high-level tournament representation has been rather poor, dedicated players like LordMix have been able to overcome Bowser's limitations and win difficult matchups against high-level players of top-tier characters, such as Vinnie's Rosalina & Luma. Most notably, ZeRo considers him to be at the top of the high tier."
    },
    {
        "name":"Dr. Mario",
        "picname":"Dr._Mario",
        "tier":"G(48)",
        "bio":"Dr. Mario (Dr. マリオ, Dr. Mario) is a playable character in Super Smash Bros. 4. His return to the series was officially confirmed on October 9th, 2014 as part of a post-release announcement. However, all three were instead converted into being clones late in SSB4's development, with Masahiro Sakurai explaining that the reason for doing so in regard to Dr. Mario was in order to appeal to his fanbase from Super Smash Bros. Melee. Dr. Mario is also the first of three Melee characters that were cut from Super Smash Bros. Brawl to return for SSB4, followed by Roy and Mewtwo. However, he retains his status as an unlockable character, whereas Roy and Mewtwo are now downloadable content. Like Mario, Dr. Mario's moveset has very slightly changed since his last appearance; most notably, he now possesses a Final Smash called Doctor Finale. Charles Martinet reprises his role as Dr. Mario's voice actor, albeit via Mario's voice clips from Brawl. Dr. Mario is currently ranked 48th out of 58 on the tier list, placing him in the G tier. This is a vast drop from his placement in Melee, where his ranking of 11th out of 26 placed him in the mid-tier and higher than his normal self. While Dr. Mario's power has increased overall, his mobility has become noticeably slower and less nimble, with these traits having been implemented in order to differentiate him from Mario. Dr. Mario's recovery and combo game are also inferior to Mario's, which altogether have resulted in him having poor representation and below average results in competitive play. Despite his glaring flaws, Dr. Mario has gained status as a niche character in competitive play. This is courtesy of his metagame being expanded by professionals, such as 2ManyCooks, Atomsk and Nairo, who have shown that he can still be an effective choice in certain matchups."
    },
    {
        "name":"Yoshi",
        "picname":"Yoshi",
        "tier":"D(23)",
        "bio":"Yoshi (ヨッシー, Yoshi) is a playable character in Super Smash Bros. 4. His return to the series was confirmed during the April 8th, 2014 Super Smash Bros. Direct, making him the last of the 'perfect-attendance crew' to be announced. Additionally, he was among the first wave of amiibo figures. Yoshi is once again voiced by Kazumi Totaka, albeit via voice clips recycled from earlier installments of Super Smash Bros. as well as every game Yoshi has spoken in since Yoshi's Story. Yoshi is currently ranked 23rd out of 58 on the tier list, placing him at the top of the D tier and making him the highest ranking mid-tier character. This is a vast improvement from his placement in Brawl, where he was ranked 27th out of 38. Yoshi sports a healthy mix of speed and power, as well as impressive aerial mobility for a heavyweight. He boasts the fastest air speed in the game and possesses a double jump which not only grants the most distance out of any double jump in the game, but also grants him armor, all of which make Yoshi difficult to contend with in the air. Another of Yoshi's greatest assets is his Egg Throw, which is an effective and versatile projectile that also aids his recovery and has mindgame potential when b-reversed multiple times. However, Yoshi's grab game is poor due to his grabs being laggy and his throws having little to no utility. His rolls and sidesteps are short-distanced and are among the slowest in the game, making him susceptible to pressure should the opponent close the gap between them. Lastly, Yoshi has very minimal vertical recovery outside of his double jump, making him vulnerable to gimping."
    },
    {
        "name":"Donkey Kong",
        "picname":"Donkey_Kong",
        "tier":"D(25)",
        "bio":"Donkey Kong (ドンキーコング, Donkey Kong) is a playable character in Super Smash Bros. 4. His return to the series was confirmed on June 11th, 2013 during the E3 Nintendo Direct. As in previous installments, Donkey Kong also retains his realistic gorilla grunts, albeit with a new set of voice clips. Donkey Kong is currently ranked 25th out of 58 on the tier list, placing him in the D tier. This makes him the highest ranked super heavyweight and is an improvement from his placement in Brawl, where he was ranked 21st out of 38. Donkey Kong retains his signature power, mobility, and spacing options, with his renowned back aerial remaining a quick and powerful option to stop approaches and deal damage. However, Donkey Kong now boasts great combo potential thanks to his up 'cargo throw', which allows for guaranteed follow-ups at varying percents and even a guaranteed KO combo at a small range of percents. However, Donkey Kong retains many of his flaws from Brawl. His large hurtbox has become even larger, which makes him even more susceptible to combos than before, while his poor vertical recovery continues to render him very susceptible to edgeguarding. Nevertheless, Donkey Kong's advantages generally outweigh his disadvantages, to the point that he has achieved above average results in competitive play, largely thanks to DKwill and Larry Lurr."
    },
    {
        "name":"Diddy Kong",
        "picname":"Diddy_Kong",
        "tier":"S(1)",
        "bio":"Diddy Kong (ディディーコング, Diddy Kong) is a playable character in Super Smash Bros. 4. He was confirmed on February 21st, 2014, coinciding with the international release date of Donkey Kong Country: Tropical Freeze. Diddy Kong retains his realistic chimpanzee screeches from Super Smash Bros. Brawl. Diddy Kong currently rests at 1st out of 58 characters in the tier list, on the S tier, a slight rise from being 4th out of 38 in Brawl. Diddy Kong's strengths lie in his profound comboing ability, with attacks flowing very well together as a result of their surprisingly long reach for a character of his size, quick frame data, and low knockback. He also has a fair share of strong finishers, such as his smash attacks, which he can combo into. He is highly mobile and has a strong neutral game thanks to his Banana Peel and Peanut Popgun. However, Diddy Kong is quite susceptible to being gimped, as Monkey Flip is linear and short-distanced while Rocketbarrel Boost is very unsafe to use from virtually any distance. He also suffers from a poor damage output, exacerbated by his poor aerial mobility when not using special moves, which hinders his aerial combo game. Finally, his Banana Peel, which heavily contributed to his top tier status in Brawl, has reduced stage control potential and is no longer capable of locking or zero-deathing opponents as the active Banana Peel maximum was reduced to one. Still, his strengths generally outshine his flaws, and he has seen some of the best tournament representation and results of any character in spite of being severely nerfed by updates. Despite this, Diddy's tier placement is somewhat debated, as other characters such as Mario have recently been more dominant in competitive play; in particular, Diddy's best player ZeRo no longer shows the same level of dominance as he once did, even in the early days of version 1.1.6."
    },
    {
        "name": "Link",
        "picname": "Link",
        "tier": "F(43)",
        "bio": "Link (リンク, Link) is a playable character in Super Smash Bros. 4. His return to the series was confirmed on June 11th, 2013 during the E3 2013 Nintendo Direct.[1] Additionally, he was also among the first wave of amiibo that are compatible with SSB4. Like in Super Smash Bros. Brawl, Akira Sasanuma reprises his role as Link's voice actor, albeit via voice clips recycled from The Legend of Zelda: Twilight Princess. Link is currently ranked 43rd out of 58 on the tier list, placing him at the bottom of the F tier. This is a noticeable improvement from his bottom-tier placement in Brawl, where he was ranked 35th out of 38. Link's possesses multiple projectiles in the form of his Hero's Bow, Gale Boomerang and Bomb, each of which serve as great tools for combos, camping, gimping, and disrupting approaches. In addition to his projectiles, Link's Master Sword grants him a disjointed reach and is quite powerful. Aside from his retained strengths, his recovery has been greatly buffed from Brawl thanks to Spin Attack covering noticeably more distance, which is further supplemented by to his Clawshot's ability to function as a tether grab and his Bomb's ability to remove him from helplessness. As a heavyweight, his respectable durability allows him to take advantage of the rage mechanic introduced in SSB4, which further bolsters his already powerful attacks. However, Link remains held back by his relatively sluggish frame data. He has moves that are quite easily punishable if they are whiffed, while his heavy weight and slow mobility without super glide tossing render him vulnerable to combos, especially from the fast, rushdown-oriented characters that are prevalent in the metagame. Despite Link's new assets, several of his fellow veterans gained more significant buffs, which downplays the effects that his own buffs grant him in competitive play. Although he has a number of dedicated mains to his credit, such as Scizor, T and Sova Unknown, Link's early tournament results have been mediocre at best. However, his results have recently improved, to the point that he has achieved top 8 and 16 placements more frequently, and even at national level, T has been achieving high placings. This in turn has brought up some debate within the community over whether Link is truly a low-tier character."
    },
    {
        "name": "Zelda",
        "picname": "Zelda",
        "tier": "H(55)",
        "bio": "Zelda (ゼルダ, Zelda) is a playable character in Super Smash Bros. 4. She was announced on December 26th, 2013, the date on which The Legend of Zelda: A Link Between Worlds was released in Japan. Jun Mizusawa, who voiced Zelda in Melee, Brawl, The Legend of Zelda: Ocarina of Time, and The Legend of Zelda: Twilight Princess, reprises her role albeit via recycled voice clips from Brawl. Zelda is currently ranked 55th out of 58 on the tier list, placing her in the H tier. This is a marginal improvement from her placement in Brawl, where she was ranked 37th out of 38. Zelda possesses some strengths, with Farore's Wind arguably being her most notable one: it has utility as both a long-distanced recovery move and her strongest finisher (especially from out of shield), with its power enabling her to KO middleweights and heavyweights as low as 50% and 70%, respectively. She has also gained a capable damage racking game, thanks to changes inherent during SSB4's launch and from subsequent game updates. Outside of these changes, Zelda retains a number of fairly powerful attacks, particularly her forward smash, up smash and Lightning Kicks. However, Zelda's numerous flaws are severe enough to completely outweigh these strengths: her mobility, hitbox placements, survivability, and neutral game are all among the worst, while her projectiles are middling. A large number of her attacks are KO moves that require the landing of a sweetspot to be effective, resulting in her KOing ability being rather weak and netting her an abundance of ineffective moves. Din's Fire is slow, easily avoidable and leaves Zelda vulnerable due to its lag and rendering her helpless in midair, though it has use in doubles by supporting a teammate. Phantom Slash requires charging to cover any actual distance and can even be rendered temporarily inactive if the Phantom is destroyed, but it can become a useful edge-guarding option if timed properly and also possesses impressive power when fully charged. Finally and most notably, Zelda can no longer Transform into Sheik to alleviate her weaknesses, due to the latter having become an entirely separate character. This is compounded even further by the massive amount of buffs Sheik received."
    },
    {
        "name": "Sheik",
        "picname": "Sheik",
        "tier": "H(3)",
        "bio": "Sheik (シーク, Sheik) returns as a playable fighter in Super Smash Bros. 4. She was confirmed during the Super Smash Bros. Direct on April 8th, 2014, a day before the Australian releases of The Legend of Zelda: Four Swords Adventures and The Legend of Zelda: The Minish Cap. Jun Mizusawa, who is also the voice actress for Zelda, reprises her role as Sheik, albeit via recycled voice clips from Brawl. Sheik currently ranks 3rd on the SSB4 tier list, as one of seven characters in the S tier, a striking improvement from 25th place out of 38 characters in Brawl and her best tier placement to date (only when modern tier lists are taken into account, as she was 1st for a long time at the start of Melee). Sheik was near-universally considered the best competitive character in the early metagame of SSB4 due to her extremely fast and safe attacks. In addition to her combo strings, Sheik has gained formidable killing tools in her up aerial and her new down special Bouncing Fish. If played correctly, nearly everything she does is near-unpunishable, giving her an unrivaled neutral game. This is supplemented by an excellent projectile in Needle Storm; its speed and transcendent priority allow Sheik to outcamp almost every other character in the game and make her all the more difficult to approach. While most of her moves generally deal very low damage and knockback, this is compensated by her strong combo ability, and even if she fails to pull off a KO setup, her advantages mean that she can afford to KO later than other characters. Sheik does have shortcomings, however. Sheik's low overall damage output, mediocre smash attacks, and lack of setups at high percents means she has to rely on hard reads to properly take a stock. This may cause her to be vulnerable to the effects of rage and can make her open to momentum shifts. Her endurance isn't impressive either; she suffers from being tall and light, which makes her take more knockback while still being relatively easy to hit, which means she has to play cautiously to gain the upper hand. Sheik still has the tournament results to match her reputation, though, being used by many top players and achieving notable competitive success as a main or secondary for many top players, and in the previous tier list she was ranked as the absolute best in the game. However, Sheik would go on to receive notable nerfs in update 1.1.5, leaving players to drop her in favor of characters that weren't nerfed as greatly in said patch. This has caused her tier position to drop slightly, but nevertheless she has still earned strong tournament results and is still considered by many as one of the best characters in the game."
    },
    {
        "name": "Ganondorf",
        "picname": "Ganondorf",
        "tier": "H(56)",
        "bio": "Ganondorf (ガノンドロフ, Ganondorf) is a playable character in Super Smash Bros. 4. He was officially revealed as a playable veteran on October 15th, 2014, although he was leaked four times prior to his reveal: via video footage from ESRB, outside the in-game stage boundaries in an official video (later replaced with a nearly-identical video sans Ganondorf), in Twitch livestreams and even a mention in Masahiro Sakurai's Pic of the Day five days before his official reveal. Ganondorf is once again voiced by Hironori Miyata, albeit via recycled voice clips from his appearance in The Legend of Zelda: Twilight Princess. Ganondorf is currently ranked 56th out of 58 on the tier list, placing him in the H tier. This is a very slight improvement from his ranking in Brawl, where he was the lowest ranked character in said game, although he is once again the lowest-ranked heavyweight. Ganondorf is still one of the hardest-hitting fighters in the game with his renowned raw power and high overall damage output being further boosted from the transition to Smash 4. He has a slightly faster dashing speed, quicker moves and new knockback angles that allow short (though damaging) combo strings; coupled with his strength buffs and the introduction of rage, this supplements his extremely strong punish game, allowing him to rack up damage and KO opponents in a few well-positioned attacks. Thanks to the new game mechanics, Ganondorf is also now notably more effective in other areas, which further cements his status as a powerhouse. This includes being one of the game's most proficient shield breakers courtesy of the damage increase on shields, while also being less vulnerable to out of shield punishment. He is no longer vulnerable to edgehogging, while Flame Choke is now useful for as a sacrificial KO against potential edgeguarders. Finally, he retains his strong edgeguarding game courtesy of powerful aerials (with his down aerial still being the strongest meteor smash in the game). Altogether, Ganondorf is now substantially rewarded for landing attacks, allowing him to deal ruthless punishes when the opportunity arises."
    },
    {
        "name": "Toon Link",
        "picname": "Toon_Link",
        "tier": "C(17)",
        "bio": "Toon Link (トゥーンリンク, Toon Link) is a playable character in Super Smash Bros. 4. His return to the series was announced on the official website on September 26th, 2013, the same day that The Legend of Zelda: The Wind Waker HD was released in Japan.[1] Sachi Matsumoto reprises her role as Toon Link's voice actor, albeit via voice clips recycled from Super Smash Bros. Brawl. Unlike in Brawl, he is now a starter character, instead of an unlockable character. Toon Link is currently ranked 17th out of 58 on the tier list, placing him at the top of C tier and in the middle of the high-tier. This is a slight improvement compared to his placement in Brawl, where he was ranked 13th out of 38. Toon Link has multiple projectiles, which grant him a powerful zoning game and enable him to follow up into different moves; his Bomb in particular is his most notable set-up for combos and KOs. Toon Link's grab game has also been improved: his grabs now have less ending lag when missed, his grab aerial is better for zoning due to it now possessing knockback, and his back throw is now among the strongest throws in the game thanks to its significantly increased knockback. While Toon Link's ground game is potent, his air game is marred by his floatiness and sub-par air speed. Additionally, his aerial attacks' power and utility are offset by their high landing lag, which prevents them from following up into other moves. Lastly, as his combo game largely relies on his projectiles, reflection-based moves can both significantly hinder his combo game and turn his projectiles against him. Toon Link has achieved impressive tournament results, thanks to the efforts of professionals like Zan and Hyuga, the latter of whom notably placed 9th at GENESIS 3 and 5th at CEO 2016. However, since Hyuga has been banned from various tournaments as of EVO 2016, Toon Link's results have plummeted significantly, to the point that he has achieved very minimal results since Hyuga's ban. As a result, Toon Link's tier placement has become highly debatable."
    },
    {
        "name": "Samus",
        "picname": "Samus",
        "tier": "G(45)",
        "bio": "Samus (サムス, Samus) is a playable character in Super Smash Bros. 4. Her return to the series was confirmed in the E3 2013 trailers on June 11th, 2013, while she was also among the first wave of amiibo figures that are compatible with SSB4. However, unlike in Super Smash Bros. Brawl, Samus is no longer capable of transitioning into Zero Suit Samus, with the latter now becoming a standalone character. Samus is currently ranked 45th out of 58 on the tier list, placing her in the G tier. This is a noticeable improvement over her bottom-tier placement in Brawl, where she was ranked 32nd out of 38. Samus possesses numerous projectiles in the form of her Charge Shot, Missile and Bomb, all of which grant her strong zoning potential alongside her Grapple Beam. Charge Shot also functions as a fearsome KOing option and a strong punishing option in many situations due to its high damage output and excellent knockback, while her Bomb and Grapple Beam can aid her recovery. Samus also possesses a good air game that allows for powerful and highly damaging combos when she finds or sets up an opening, which is further supplemented by set-ups in the form of her dash attack, up tilt, down aerial, down throw and Grapple Beam. However, Samus' moveset forces her to be reliant on defensive spacing to keep opponents at bay. Except for her down tilt, all of her moves are generally less effective at point-blank range, while they also render her prone to trading hits with opponents even at mid-range. When combined with her floatiness and average mobility, these traits can make it difficult for Samus to escape from juggling and other problematic situations. While Samus has noticeably improved since Brawl, largely due to game updates, most of her fellow veterans have also improved at varying degrees. This has resulted in her overall representation being poor, although she has attained a dedicated playerbase nevertheless, which includes professionals such as IcyMist, ESAM, and Jonny Westside. Thanks to the efforts of her playerbase, Samus has managed to achieve some degree of tournament success."
    },
    {
        "name": "Zero Suit Samus ",
        "picname": "Zero_Suit_Samus",
        "tier": "A(8)",
        "bio": "Zero Suit Samus (ゼロスーツサムス, Zero Suit Samus) is a playable character in Super Smash Bros. 4. She was confirmed in the Super Smash Bros. Direct on April 8th, 2014, exactly a decade after Metroid: Zero Mission was released in Europe. Zero Suit Samus is now a standalone character, which means that she cannot activate or deactivate her her Power Suit under any circumstances. Zero Suit Samus is once again voiced by Alésia Glidewell, albeit via recycled voice clips from Super Smash Bros. Brawl. Zero Suit Samus is currently ranked 8th out of 58 on the tier list, placing her in the A tier. This is a small improvement from her placement in Brawl, where she was ranked 9th out of 38. Zero Suit Samus possesses a dominant air game, with two very safe aerials in her neutral and back aerials, while her up aerial is incredibly effective for juggling. Zero Suit Samus also has what is arguably the best punishment game, courtesy of her fast and nimble mobility, a paralyzing projectile in Paralyzer, and a potent combo game that can lead to either KOs or large amounts of damage in quick fashion. In addition, Zero Suit Samus possesses a long-distanced and varied recovery, courtesy of having two tether recoveries, a third jump in Flip Jump and her new up special, Boost Kick. While she has outstanding positives, Zero Suit Samus also has some negatives. Her grab game is very poor; while her grabs have very good range and her down throw is a reliable aerial combo starter, her grabs are all extremely slow and thus punishable if whiffed. Her ground game is also somewhat poor compared to her amazing air game, while her off-stage presence is minimal despite her great aerial mobility and varied recovery. Zero Suit Samus has a weak neutral game, requiring players to utilize great mix-ups along with spacing in order to efficiently rack up damage, score KOs, and avoid punishment. Regardless of her flaws, Zero Suit Samus is widely considered to be an outstanding character, to the point that she was viewed as a top 3 character in the early SSB4 metagame until she was nerfed in updates 1.1.4 and 1.1.5. This reputation is thanks to her playerbase, particularly Nairo, consistently achieving high tournament results."
    },
    {
        "name": "Kirby",
        "picname": "Kirby",
        "tier": "F(41)",
        "bio": "Kirby (カービィ, Kirby) is a playable character in Super Smash Bros. 4. He was confirmed on June 11th, 2013 during the E3 2013 Nintendo Direct. He was also among the first wave of amiibo figures that are compatible with SSB4. Kirby is again voiced by Makiko Ōmoto, who provided new voice clips that changed Kirby's inflections somewhat compared to the previous games in the series. Kirby ranks 41st out of 58 on the tier list, placing him in the F tier. This is a vast downturn for Kirby, as he was a mid-tier character in Brawl where he ranked 20th out of 38. Kirby possesses a great combo game, courtesy of his up tilt and his up aerial's excellent juggling potentials, as well as good frame data throughout most of his moveset. Despite his size, Kirby also has great KO potential due to his powerful up throw and guaranteed KO set-ups off of his down aerial on floatier characters. His crouch is also very useful, allowing him to avoid many moves from a variety of characters, along with a number of grabs from taller characters. However, Kirby retains many of his flaws from Brawl, the most notable of which is his poor survivability as a result of his floatiness and extremely light weight. When this is coupled with his predictable recovery, Kirby is left prone to either getting KO'd off of the blast zones early or being edgeguarded early. His mobility is also poor, leaving him prone to being zoned out by many characters, though his crouch can help alleviate some pressure against projectiles that are not affected by gravity. Lastly, Kirby's range has also been nerfed, due to his feet becoming smaller. Because of these flaws, Kirby is seen by some as a below average character in SSB4, although his tournament representation is average and he has even achieved a few results at top-level tournaments courtesy of MikeKirby and K.I.D. Goggles."
    },
    {
        "name": "Meta Knight",
        "picname": "Meta_Knight",
        "tier": "B(13)",
        "bio": "Meta Knight (メタナイト, Meta Knight) is a playable character in Super Smash Bros. 4. Initially teased as a Mii Fighter costume on August 11, 2014, his return to the series was confirmed two days later. Eric Newsome and Atsushi Kisa'ichi both reprise their roles as Meta Knight's voice actors in the English and Japanese releases, respectively, albeit using recycled voice clips from Super Smash Bros. Brawl. Meta Knight is ranked 13th out of 58 on the tier list, placing him in the B tier and making him the second highest ranking high-tier character. This is a noticeable drop from his placement in Brawl, where he was ranked 1st out of 38, though his drop is not as severe as the ones endured by formerly high-ranking veterans like fellow Kirby series representative King Dedede. Meta Knight retains his quick mobility from Brawl, which was also been improved; he sports a fast dashing speed, five midair jumps, and a high falling speed. This also extends to his offense, as Meta Knight's attacks possess very quick start-up and disjointed range, granting him a formidable combo game which can also zero-to-death opponents and allows him to easily edgeguard due to his midair jumps. He also boasts an impressive recovery thanks to his midair jumps and having three special moves that are reliable at bringing him back on-stage. However, likely due to his dominance in Brawl, he received heavy nerfs in the transition to SSB4: his unrivaled attack speed, range, recovery and overall damage output have been toned down (though the former three remain strong and he still has a great combo game), while the transcendent priority on his attacks has been completely removed, weakening his approach options. When combined with his lack of a projectile, these changes give him a harder time overcoming camping strategies. Although Meta Knight's high falling speed is an important aspect of his mobility, it is also detrimental due to his low weight, as they leave him vulnerable to both combos and KOs. His survivability is also exacerbated by the nerfs to his recovery, with the most notable example being the removal of gliding."
    },
    {
        "name": "King Dedede",
        "picname": "King_Dedede",
        "tier": "H(52)",
        "bio": "King Dedede (デデデ, Dedede) is a playable character in Super Smash Bros. 4. His return to the series was announced on January 10th, 2014 to commemorate the release of Kirby: Triple Deluxe in Japan. He is once again voiced by Masahiro Sakurai, the long-time Kirby producer and the creator and director of the Super Smash Bros. series, albeit with more realistic versions of his Brawl voice clips. King Dedede is currently ranked 52nd out of 58 on the tier list, placing him in the H tier. This makes him the second highest ranked bottom-tier character, which is a significant drop from his high-tier placement in Brawl, where he was ranked 12th out of 38. This also gives Dedede the distinction of having the second largest tier drop from Brawl to SSB4. Dedede's primary strength is his large disjointed range, courtesy of his hammer. In addition to his range, he also possesses some very powerful punishing moves, such as his forward smash, down smash, back aerial and down aerial, with the latter two also functioning as good edgeguarding moves. Dedede also boasts arguably the greatest overall survivability in the game, being the most difficult character to KO vertically, due to having the third highest weight and the second fastest falling speed, and also very difficult to KO horizontally despite being a fast-falling character with slow air speed, which is also due to his high weight and the fact that he boasts an impressive recovery, due to his multiple midair jumps and Super Dedede Jump. However, King Dedede's tier drop is largely due to the weakening or total removal of moves and/or mechanics that were important to his neutral game. The most examples are the removal of chain grabbing and his back aerial, as well as his significantly worsened grab game, which has gone from one of the best to just below average. Additionally, he retains his poor mobility and sluggish frame data from Brawl: he has among the slowest walking and dashing speeds, while his air speed, which was already the slowest in Brawl, has become even slower."
    },
    {
        "name":"Fox",
        "picname":"Fox",
        "tier":"S(7)",
        "bio":"Fox (フォックス, Fox) returns as a playable character in Super Smash Bros. 4. He was one of the characters confirmed to return in the game during the E3 2013 trailers on June 11th, 2013. He was also among the first wave of amiibo figures that are compatible with SSB4. Kenji Nojima reprises his role as Fox in the Japanese version with re-recorded voice clips. However, Mike West, Fox's original English voice actor who voiced him in Star Fox 64, reprised his role in the 3DS remake, Star Fox 64 3D and in the Wii U title, Star Fox Zero, now once again voices Fox, replacing Jim Walker. Fox is currently ranked 7th out of 58 characters in the tier list, placing him as the lowest ranked S tier and a significant rise from his previous position from Brawl where he was ranked 15th of 38 characters. Fox's strengths include very quick mobility, a fast and transcendent projectile in his Blaster, and an anti-camping move in his Reflector. Altogether, these grant him one of the fastest and safest approaches in the entire game and allow him to easily keep up with almost any opponent. Fox also boasts a versatile combo game thanks to his quick, low knockback moves, along with capable KOing power, with a quick and powerful finisher in his up smash. However, Fox's extremely fast falling speed, very high gravity and light weight make him one of the easiest characters to both combo and KO, making him prone to momentum shifts. His recovery, while long-distanced, is extremely predictable. His grab game is also faulty, as his throws lack utility due to having no follow-ups past medium percentages or being realistic KOing options. The introduction of rage further burdens Fox, as the efficiency of his combos drops dramatically with it, while he becomes even easier to KO. Regardless, Fox's weaknesses are not enough to keep him out of the top tier, which is evident by his high tournament representation (with dedicated mains such as Larry Lurr) and great results."
    },
    {
        "name": "Falco",
        "picname": "Falco",
        "tier": "G(49)",
        "bio": "Falco (ファルコ, Falco) returns as a playable character in Super Smash Bros. 4. Falco was officially confirmed on October 3rd, 2014, coinciding with the North American and European release of Super Smash Bros. for Nintendo 3DS. In Japanese, he is once again voiced by Hisao Egawa via re-recorded voice clips. In English, Mark Lund, Falco's voice actor from Star Fox 64 3D and Star Fox Zero, now voices him, replacing Dex Manley from Brawl. Falco is currently ranked 49th out of 58th on the tier list, a vast drop from Brawl where he was ranked 7th out of 38, making this his worst placement in the series. The majority of Falco's moves have high speed and very favorable angles, granting him a strong combo game and juggling capabilities. These are further aided by his good grab game and strong jumps, with the latter remaining the highest in the game. His moves that lack speed or reach are also packed with power, giving his moves surprisingly high KO power; for example, his back aerial can reliably KO below 130%. He also boasts an effective grab game and out of shield game, with all of his throws possessing great utility and/or KO power, while the speed of his moves allows him to easily punish opponents out of shield. However, Falco's neutral game has been drastically weakened, with several of the moves that made him a threat at all ranges being nerfed: his two staple moves, Blaster and down aerial, now being much slower. Both are also incapable of autocancelling in a short hop, eliminating Falco's ability to approach safely, whereas his back aerial has less reach and shorter duration, making it less effective at spacing. Finally, even though Falco benefits from the changes to hitstun cancelling as they make down throw much better for combos, it can no longer lead into the Gatling Combo or rack up damage on its own. In fact, the changes to game mechanics have hindered Falco overall, as the removal of DACUS (and the aforementioned Gatling Combo) and chain grabbing hurt his damage racking capabilities overall, while the introduction of rage makes him more susceptible to KOs, due to his light weight. His recovery, despite being long distanced and buffed overall, is still slow and is easily intercepted, making Falco vulnerable to gimps. In the end, the sheer weakening of the tools that gave him such a powerful neutral game (in some cases in exchange for higher power) and the changes to game mechanics have resulted in his tier drop from Brawl being the single largest, with his presence in this game being almost completely overshadowed by that in the last two games, resulting in mediocre tournament representation and results in competitive play."
    },
    {
        "name": "Pikachu",
        "picname": "Pikachu",
        "tier": "B(12)",
        "bio": "Pikachu (ピカチュウ, Pikachu) is a playable character in Super Smash Bros. 4. Its return to the series was confirmed on June 11th, 2013 during E3 2013, while it was also among the first wave of amiibo. Ikue Ōtani reprises her role as Pikachu's voice actor, albeit via recycled voice clips from Melee and Brawl. Pikachu is currently ranked 12th out of 58 on the tier list, placing it at the top of B tier and results in it being the highest ranking high-tier character. This is a slight increase from its ranking of 8th out of 38 in Brawl. Pikachu's positives include its fast overall speed, excellent approach, good neutral and combo games, and excellent recovery. However, it has weaknesses as well, most notably its poor survivability and weak KO potential. As a result, Pikachu has a high learning curve and minimal high-level representation compared to other high-tier characters, but it has nonetheless achieved notable tournament results, mostly thanks to ESAM. The overall competitive community opinion of Pikachu has been volatile since SSB4's release. Initially, it was widely seen as an average character, but after a number of impressive tournament showings by ESAM (including his brief period of retirement having added to the 'mystery' of Pikachu's potential), it was seen as high as a top 3 character by players like ZeRo and ESAM himself, culminating in an extremely close Winners' Finals set at Super Smash Con between the two. This resulted in Pikachu placing 5th on the first tier list. In more recent times, however, public opinion has swayed again. Many considered Pikachu's ranking on the first official tier list to be far too high, which was reflected with Pikachu's placement dropping within the second tier list due to metagame development, ESAM's inconsistent showings at major tournaments, a dearth of results for Pikachu at national, regional, and even local levels of play, and downloadable content and/or game updates resulting in newfound high-tier and top-tier characters. Although update 1.1.5 nerfed some of Pikachu's hardest matchups, its current ranking on the tier list is still disputed even after the placement drop, with many players believing that Pikachu should be even lower on the tier list."
    },
    {
        "name": "Jigglypuff",
        "picname": "Jigglypuff",
        "tier": "H(58)",
        "bio": "Jigglypuff (プリン, Purin) is a playable character in Super Smash Bros. 4. It was formally added to the official website on November 5th, 2014, though the launch of Super Smash Bros. for Nintendo 3DS in Japan two months prior meant that its return to the series was already known. It was also seen several times during the Super Smash Bros. for Wii U: 50-Fact Extravaganza. Jigglypuff is once again voiced by Rachael Lillis in English and Mika Kanai in Japanese, albeit via recycled voice clips. As in previous games, it also has different voice actresses in French and German. Jigglypuff holds the distinction of ranking 58th on the tier list, placing it at the absolute bottom of the cast. This is a slight drop from its already very low placement in Brawl, where it ranked in the bottom tier at 36th out of 38. Jigglypuff retains its strong air game; it has nearly unrivaled aerial mobility thanks to its high air speed and multiple midair jumps, as well as good juggling ability thanks to its fast and long-lasting aerial attacks. All of these attributes facilitate a strong edgeguarding ability, and it can perform its signature Wall of Pain technique, albeit with less efficiency, and it has a potent finisher in its back aerial. Additionally, Rest has regained some of its power that was lost in Brawl. However, Jigglypuff also retains its glaring weaknesses, as it still suffers from a very weak ground game due to its slow mobility, short reach, and lackluster grab game with no guaranteed throw combos. Jigglypuff also has severe issues KOing, with laggy finishers and Rest being very difficult to land without a hard read. Its endurance is unarguably the worst, as it is extremely floaty and possesses the lowest weight stat in the game. While this low weight can allow it to escape from what are usually true combos, this does not make up for the frailty that results from it. This is exacerbated by the new rage mechanic and weaker shields, the latter making its instant death shield jump even more dangerous. Overall, Jigglypuff's weaknesses almost completely nullify its strengths, which has resulted in it remaining a bottom-tier character. When coupled with its lack of any buffs via patches, Jigglypuff has received virtually no tournament representation or results at high levels of play. However, it does have some positive results to its credit; Hungrybox, Serynder, and CrazieCuban have performed decently with it at regional tournaments, while LeeT notably placed 33rd at Shine 2016 while exclusively using Jigglypuff as a solo main."
    },
    {
        "name": "Mewtwo",
        "picname": "Mewtwo",
        "tier": "A(10)",
        "bio": "Mewtwo (ミュウツー, Mewtwo) is a playable character in Super Smash Bros. 4. Initially confirmed during the Super Smash Bros. for Wii U 50-Fact Extravaganza on October 23rd, 2014, Mewtwo was made available to the public on April 28th, 2015. However, players who registered both Super Smash Bros. for Wii U and Super Smash Bros. for Nintendo 3DS on Club Nintendo before March 31st, 2015 would be allowed to download Mewtwo for free on April 15th, 2015.[1] Its appearance in Super Smash Bros. 4 makes it both the first downloadable character in Super Smash Bros. history and the second of three Super Smash Bros. Melee characters that were cut from Super Smash Bros. Brawl to return to the series. Mewtwo is now voiced by Keiji Fujiwara, who replaced Masachika Ichimura. As in Melee, Mewtwo has fully voiced victory quotes in Japanese that are re-recorded versions of its victory quotes from that game, although they were removed for international versions. Its phrases, and most of its grunts and other voice clips, are inspired by those in Melee. Mewtwo is currently ranked 10th out of 58 on the tier list, placing it in the A tier and making it the third highest ranking DLC character. This is a vast improvement from its low-tier placement in Melee, where it was ranked 21st out of 26. Mewtwo's moves, most noticeably Disable and Confusion, have been generally reworked to the point that they are less awkward and much more useful than they were in Melee. Its mobility has also noticeably improved: its dashing and air speeds are among the fastest in the game, its walking speed is above average and it is now capable of wall jumping. However, Mewtwo retains its problematic combination of a tall frame and light weight, with the latter attribute having been significantly lowered since Melee. As a result, it is still vulnerable to combos and juggling, while its already poor survivability is even worse than before. Mewtwo's other issues include some of its attacks becoming slower, while its approach has been weakened due to the removal of wavedashing and moonwalking and the weakening of dash-dancing. Initially a poorly perceived character upon its release, game updates noticeably improved Mewtwo's perception and viability over time, to the point that it achieved improved tournament results thanks to professionals such as Abadango, Rich Brown, and WaDi. As a result of its consistently strong results in competitive play, Mewtwo's tier status also underwent a significant improvement, with it rising 27 spots to become a top-tier character after it was ranked as a low-tier character within the first SSB4 tier list"
    },
    {
        "name": "Charizard",
        "picname": "Charizard",
        "tier": "H(51)",
        "bio": "Charizard (リザードン, Lizardon) is a playable character in Super Smash Bros. 4. Charizard's return to the series was confirmed as part of the April 8th, 2014 Super Smash Bros. Direct, during which its fellow Pokémon representative Greninja was also confirmed. Charizard is once again voiced by Shin'ichirō Miki, who re-recorded Charizard's grunts and roars to match how it sounds in the Pokémon anime, rather than redo its coarser grunts and roars from Brawl. Charizard is currently ranked 51st out of 58 on the current tier list, placing it at the top of the H tier and making it the highest ranking bottom-tier character. This is a significant drop from Pokémon Trainer's standing in Brawl, where he had been ranked 29th out of 38. Now an individual character, Charizard no longer has to contend with stamina reducing its power and has a more consistent moveset, but is unable to switch out with other Pokémon in order to cover its significant weaknesses. Charizard is a fast character for its weight class: its boasts a decent walking speed, one of the fastest dashing speeds, and several moves with reasonable speed and combo potential. Charizard also benefits from an array of strong KOing options, high durability thanks to its weight, and a grab game that allows for combos, KO set-ups or KOing outright. Its up throw is particularly notable due to being the strongest in the game, although its KO power is most effective on stages with platforms and its knockback can be mitigated via directional influence. Additionally, its special moveset is more consistent than in Brawl and is useful both for punishing and defensive purposes. However, Charizard has some exploitable weaknesses. Despite having better frame data than its fellow super heavyweights, some of Charizard's attacks are still laggy and punishable compared to the many combo-oriented characters prevalent in the metagame. Charizard also suffers from a vulnerability to combos, a common problem among heavyweights and super heavyweights; although its escape options are assorted, they can be easy to exploit. In the early metagame, Charizard endured very poor tournament representation and results, to the point of being considered the single worst character. While Charizard has been consistently and heavily buffed via game updates, it still has an underwhelming presence in the competitive scene. Despite this, its results have gradually improved over time. The most notable instance was Sharpy winning the regional tournament BeSmash 2016 while exclusively using Charizard, an achievement that other current bottom-tier characters have failed to match. Soon afterwards, Hitomoshi achieved the same level of success by winning the regional tournament Tamisuma 63 while exclusively using Charizard. As a result, its tier placement and overall viability are highly contested, with some professionals having a much higher opinion of Charizard, such as ZeRo and ESAM ranking it 35th and 41st on their respective personal tier lists."
    },
    {
        "name": "Lucario",
        "picname": "Lucario",
        "tier": "C(22)",
        "bio": "Lucario (ルカリオ, Lucario) is a playable character in Super Smash Bros. 4. Its return to the series was announced on January 31st, 2014, six years to the day of the year that Super Smash Bros. Brawl was released in Japan. According to an extra post for its Miiverse reveal, this timing was done to commend the Brawl developers for succeeding in adding Lucario to Brawl. Lucario is now voiced by Sean Schemmel in the English version, who replaces Bill Rogers from Brawl and voiced Sir Aaron's Lucario in Lucario and the Mystery of Mew. As in Brawl, Lucario is also voiced by different voice actors for SSB4's Spanish, French, German and Italian versions. However, Daisuke Namikawa reprises its role for the Japanese version. Lucario is currently ranked 22nd out of 58 on the tier list, placing it at the bottom of the C tier and making it the lowest ranking high-tier character. This is a fairly noticeable drop from its placement in Brawl, where it was ranked 11th out of 38. Lucario's signature Aura mechanic has been strengthened, giving its moves incredible power when it is highly damaged, as well as granting new benefits to its special moves. However, some of Lucario's moves, such as its smash attacks, have been worsened in other ways, making it more dependent on Aura to secure KOs and thus giving it a riskier playstyle than before."
    },
    {
        "name": "Captain Falcon",
        "picname": "Captain_Falcon",
        "tier": "C(20)",
        "bio": "Captain Falcon (キャプテン・ファルコン, Captain Falcon) returns as a playable character in Super Smash Bros. 4. He was confirmed during a live stream on July 14th, 2014. Captain Falcon is once again voiced by Ryō Horikawa, using recycled voice clips from Brawl. Captain Falcon currently ranks 20th on the SSB4 tier list, in the C tier. This is a vast improvement over his 34th out of 38 ranking in Brawl. His rise in the tier list is largely due to the changes to hitstun canceling, restoring Captain Falcon's previously lost combo game. As usual, he combines speed and power, with an impressive combo game and great finishers to boot; for example, his dash grab is formidable and covers a long distance, and his down throw serves as an excellent combo starter into multiple aerial attacks or as a finisher into the powerful, semi-spiking ever-famed Knee Smash. However, his recovery remains linear and lackluster, and he himself is still especially vulnerable to combos and camping with his physique, tall size, and high weight and falling speed. Overall, Captain Falcon has returned to the very viable position he held in 64 and Melee, earning him strong representation and results, as well as the third largest tier rise out of the entire cast."
    },
    {
        "name": "Ness",
        "picname": "Ness",
        "tier": "B(16)",
        "bio": "Ness (ネス, Ness) returns as a playable character in Super Smash Bros. 4. Ness was officially confirmed on October 3rd, 2014, coinciding with the the North American and European release of Super Smash Bros. for Nintendo 3DS. As in every previous Smash Bros. installation, Ness is voiced by Makiko Ōmoto, who has now recorded new voice clips for both versions of the game. Ness currently ranks 16th out of 58 characters on the tier list, placing him at the end of the B tier and the middle of the high tier. This is a vast improvement from his 26th out of 38 in Brawl, and his best placement compared to previous Smash Bros. games. Ness no longer suffers from having 10 extra grab release frames, which was a huge detriment to his survival. Besides that, Ness possesses arguably the best grab game among the entire cast (competing with Mewtwo's), with his forward and up throws leaving opponents in very unfavorable positions, his down throw being a great combo starter and his back throw being the most powerful throw in the game, on top of being difficult to DI properly. Other notable strengths include an effective projectile game with PK Fire and PK Thunder, a formidable air game courtesy of his powerful aerials, and a versatile combo game thanks to his throws and aerials. Despite being a middleweight, he also has high raw KO power and high damage output, a prime example being his aerials, forward smash, PK Flash and PK Thunder 2. Finally, due to the strengths above, Ness possesses very useful options to cover getups from a ledge or on the ground. However, Ness has rather sub-par mobility and range, which often forces him to be methodical with his approaches, or play defensively in order to gain the lead. His KO power, while consistent, is relegated to only his back throw, as most of his powerful attacks are hard to land in the neutral game. Lastly, the last and the most problematic, is his recovery. Despite being greatly improved, PK Thunder remains quite gimpable as the lightning bolt can clang with other attacks, while opponents can forcibly push Ness out of the way or even take a hit from the lightning bolt, making his recovery fail. Ness's favorable traits have led him to gain strong tournament representation and use by many top players, such as FOW, Shaky and NAKAT. However, Ness's results have been stagnant as of late, mainly due to professional Ness players being considerably less active than before, most noticeably FOW, while his hardest matchups have continued to develop in the metagame. It should be noted that FOW has recently returned from a small hiatus and is garnering results with Ness, leaving his tier spot a debatable topic."
    },
    {
        "name": "Lucas",
        "picname": "Lucas",
        "tier": "E(33)",
        "bio": "Lucas (リュカ, Lucas) is a playable character in Super Smash Bros. 4. Initially absent as a playable character, Lucas' return to the series was revealed during a Nintendo Direct on April 1st, 2015. He was then made available as downloadable content on June 14th, 2015. Lani Minella reprises her role as Lucas' voice actor, albeit via recycled voice clips from Brawl and with some of the clips slightly sped up. Lucas is currently ranked 33rd out of 58 on the tier list, placing him in the E tier. This is a fairly noticeable improvement from his ranking in Brawl, where he was ranked 30th out of 38. Like his fellow EarthBound representative Ness, Lucas is no longer plagued by 10 extra grab release frames and early hitstun canceling, both of which were major detriments to his survivability and combo game, respectively. Aside from those gameplay changes, Lucas retains his fast attack speed, disjointed hitboxes, projectiles that can pressure or zone opponents, and an impressive combo game. However, while the major issues resulting in Lucas' near bottom-tier placement in Brawl have been fixed, he was nerfed due to his overall damage output, knockback, and range all being reduced, as well as the loss of several of his more advanced techniques from Brawl. Lucas also retains slow ground mobility and a recovery that is occasionally susceptible to gimps and edgeguarding. However, subsequent game updates gave Lucas further buffs that have since allowed him average results mostly thanks to the efforts of Taiheita, who has many notable placings, such as 17th in singles and 1st in doubles with Lucas at Super Smash Con 2016, along with several high placings at Sumabato and Umebura tournaments."
    },
    {
        "name": "Marth",
        "picname": "Marth",
        "tier": "C(19)",
        "bio": "Marth (マルス, Marth) is a playable character in Super Smash Bros. 4. He was announced on the official website on November 7th, 2013; years before, four Fire Emblem games were released within a similar time frame; Fire Emblem on November 3rd, 2003 in North America, The Sacred Stones and Path of Radiance on November 4th, 2005 in Europe, and Radiant Dawn on November 11th, 2007 in North America. He was among the first wave of amiibo figures that are compatible with SSB4, released on the same day as the Wii U version of the game. He is voiced once again by Hikaru Midorikawa in all regions, albeit using recycled voice clips from Brawl. Marth currently ranks 19th on the SSB4 tier list in the C tier. This is a moderate fall from his 5th place position out of 38 in Brawl. Marth's upsides include good overall mobility and disjointed range on many attacks. All of his sword-based attacks in particular are quite rewarding if they land only at the tip of his sword, often dealing absurdly high knockback despite their quick startup, most notably his forward smash and Shield Breaker. However, the drop on Marth's tier placement is largely due to his initial transition into the game and the myriad of nerfs he received in the process. The transition had hindered his reach relative to the cast (though he still has a long reach overall, and it was also buffed in its transition), and slightly increased the ending lag on many attacks, making his moveset less safe as a whole. His forward aerial, a staple move in his approaching and combo games, is slightly laggier than before. His throws are now ineffective for comboing past extremely low percents, while still unreliable for KOing, worsening his punish game. Marth's linear recovery is still susceptible to edgeguarding even with the new ledge mechanics (though it remains relatively risky to intercept due to its stage spike potential), and he is vulnerable to combos, juggling, and projectile camping due to his lack of safe methods to relieve pressure."
    },
    {
        "name": "Roy",
        "picname": "Roy",
        "tier": "G(50)",
        "bio": "Roy (ロイ, Roy) is a playable character in Super Smash Bros. 4. Initially leaked through data mining of update 1.0.6, making him the third downloadable character released and the final downloadable veteran. Jun Fukuyama reprises his role as Roy's voice actor and provides new voice clips and ones that mimic those from Super Smash Bros. Melee. Roy is currently ranked 50th out of 58 on the SSB4 tier list, placing him at the bottom of the G tier. This is a very slight improvement from his previous placement in Melee, where he was ranked 20th out of 26, and makes him both the lowest ranking low-tier character and the lowest ranking DLC character. Two of Roy's greatest perks are his overall mobility and attack speed: his ground and air speeds are among the fastest in the game, while his attacks also boast quick start-up overall (with the exception of forward smash and down aerial), allowing him to react quickly to an enemy's openings. This complements Roy's inverse tipper mechanic, with large, easy-to-land sweetspots near the hilt of his Sword of Seals, while his fast maneuverability provides him many opportunities to deal powerful hits by simply being close to the opponent. His combo game at low to medium percentages is also extremely damaging due to his throws, neutral attack and first hit of neutral aerial being able to set up into his other moves. Coupled with the power of his sweetspotted attacks, most of which are capable of KOing at realistic percentages despite their quick speed, Roy's throws and attacks are generally very rewarding to land, and he has no trouble sending damaged opponents off-stage. However, Roy's playstyle is extremely risky due to several factors. Despite his speed, he has an ineffective approach due of his lack of a projectile. Furthermore, despite his very fast air speed, he has very slow air acceleration, forcing him to be committal to his approaches in general, and makes him very open to retaliation if he whiffs a move since he is unable to retreat once he begins an approach. Roy's inverse tipper also inadvertently gives him poor range for a swordsman, which is further compounded by his attacks having considerable ending lag and his aerial attacks being incapable of autocanceling from a short hop. Altogether, these traits render his moveset very punishable and unsafe on shield despite his overall power."
    },
    {
        "name": "Ike",
        "picname": "Ike",
        "tier": "E(35)",
        "bio": "Ike (アイク, Ike) is a playable character in Super Smash Bros. 4. His return to the series was confirmed in a Director's Room Miiverse post on May 23rd, 2014, the same day that Fire Emblem: The Sacred Stones was released in North America in 2005. Jason Adkins (via voice clips recycled from Brawl) and Michihiko Hagi reprise their roles as Ike's voice actors in the English and Japanese versions, respectively. Ike is currently ranked 35th out of 58 on the tier list, placing him in the E tier. This is very similar to his placement in Brawl, where he was ranked 23rd out of 38. Ike largely retains his high power and impressive range, but now boasts improved speed in regard to overall mobility and frame data. He has also gained an effective combo game, which aids his ability to space out his opponents. However, Ike retains his flaws from Brawl: his heavy weight renders his overall mobility as only average at best despite its improvements, his very minimal amount of fast grounded attacks often leaves him vulnerable against rushdowns, combos, and projectile camping, while his recovery is still linear and easily predictable despite being long-distanced and benefiting from the new edge mechanic. He has also gained new weaknesses: his already large hurtbox is slightly larger, several of his attacks have decreased ranges and knockback, and his very useful jab cancel is extremely situational at best due to being significantly more difficult to perform into itself. Overall, Ike's buffs have helped him remain viable despite his nerfs, as evident by him achieving average tournament results, largely thanks to Ryo, San and Waldo."
    },
    {
        "name": "Mr. Game & Watch",
        "picname": "Mr._Game_&_Watch",
        "tier": "F(37)",
        "bio": "Mr. Game & Watch (Mr.ゲーム＆ウォッチ, Mr. Game & Watch) is a playable character in Super Smash Bros. 4. After making a cameo in Pac-Man's trailer, Mr. Game & Watch was formally revealed on October 23rd. during the Super Smash Bros. for Wii U: 50-Fact Extravaganza. Like in Melee and Brawl, he uses Game & Watch-esque sound effects to represent his 'voice'. Mr. Game & Watch is currently ranked 37th out of 58 on the tier list, placing him at the top of the F tier and making him the highest ranking low-tier character. This is a drop from his ranking in Brawl, where he was ranked 16th out of 38. Mr. Game & Watch's strengths include great combo and air games and, despite being a lightweight, a high overall damage output. His overall mobility is also decent, with his recovery in particular being impressive due to Fire's long coverage, large edge sweetspot, and general safety. However, Mr. Game & Watch possesses notable weaknesses as well. His biggest flaw is his surprising inability to KO, due to his finishers being plagued in one way or another. This includes them either being situational (Judge or Oil Panic), having large sourspots (forward and down smashes), minimal range (up smash), unreliability in connecting properly (up aerial), high start-up or ending lag, or simply lacking sufficient knockback (forward and down tilts). He is also the third lightest character in the game, making him prone to getting KO'd quite easily, which is further exacerbated by the loss of Bucket Braking. Due to his short stature, Mr. Game & Watch's range is mediocre overall, despite most of his hitboxes being disjointed. His moves also suffer from high ending lag despite their damage outputs and knockback. His grab game is also lackluster outside of down throw, as his pummel is one of the slowest in the game, and none of his other throws possess the utility that his down throw does, nor are they strong enough to KO at realistic percentages. His neutral game is also lacking, due to having no aerials that autocancel from a short hop and his limited amount of safe options on shield. Lastly, some of his moves are considered to be situational, due to either needing luck (Judge) or needing the opponent to have an energy-based projectile (Oil Panic). Overall, Mr. Game & Watch's strengths are generally on par with his weaknesses. While his tournament representation is poor overall due to his character flaws and unpopularity in competitive play, he has achieved above average tournament results, such as Regi placing 17th at EVO 2016."
    },
    {
        "name": "Pit",
        "picname": "Pit",
        "tier": "D(24)",
        "bio": "Pit (ピット, Pit) is a playable character in Super Smash Bros. 4. His return to the series was confirmed on June 11th, 2013 during the E3 2013 Nintendo Direct. Instead of retaining Lani Minella as his voice actor from the English version of Super Smash Bros. Brawl, Pit is now voiced by Antony Del Rio in the English version of SSB4, who reprises his role from the English version of Kid Icarus: Uprising. Minami Takayama, who voiced Pit in the Japanese versions of Brawl and Uprising, also reprises her role. Pit is ranked 24th out of 58 on the tier list, placing him in the D tier and making him the second highest ranking mid-tier character. This is an improvement from his placement in Brawl, where he was ranked 17th out of 38. The number of differences between the Pits is extremely small, yet somewhat noticeable: Pit's forward tilt and Palutena Bow are stronger and much more maneuverable than Dark Pit's forward tilt and Silver Bow, respectively. Conversely, Silver Bow is stronger than Palutena Bow and Electroshock Arm is a more reliable KOing option compared to Pit's Upperdash Arm. Outside of these differences, both Pits share the same primary strengths and weaknesses: they have capable damage racking games, great recoveries and are strong edgeguarders thanks to their multiple jumps, yet their KOing options are limited to the point of largely forcing them to rely on aggressive edgeguarding or the risky Upperdash/Electroshock Arm in order to score KOs. Overall, Pit has a small playerbase with average low-level results, but below average high-level results."
    },
    {
        "name": "Wario",
        "picname": "Wario",
        "tier": "E(34)",
        "bio": "Wario (ワリオ, Wario) returns as a playable character in Super Smash Bros. 4. He was officially confirmed on October 3rd, coinciding with the North American and European release of Super Smash Bros. for Nintendo 3DS. This time around, he is unlockable, as opposed to being available from the start in Brawl. He retains his biker outfit from the WarioWare series, as well as his overalls from the Mario games. He is voiced by Charles Martinet, who voices the character in all but a few of his appearances, as well as Mario, Luigi, and Waluigi, using the same voice clips from Brawl. In the current tier list, Wario is ranked at 34th position out of 58 characters, a large drop from his 10th out of 38 in Brawl. Like in Brawl, Wario surprisingly possesses great aerial mobility and good overall mobility for a heavyweight, with great aerial attacks and a strong ground game to complement this. However, while some of his finishers were made more powerful, they are more laggy on either start up or end/landing lag, and he still remains susceptible to projectile camping due to his lack of a true projectile. Also, like in Brawl, Wario is still vulnerable to aerial attacks and his own aerials can be countered easily due to their poor range. Overall, Wario is still a viable choice in competitive play, but requires more precision and patience to get similar results."
    },
    {
        "name": "Olimar",
        "picname": "Olimar",
        "tier": "E(30)",
        "bio": "Olimar (ピクミン＆オリマー, Pikmin & Olimar) is a playable character in Super Smash Bros. 4. His return to the series was announced on July 12th, 2013 via SSB4's official website, which made him the first character revealed after the initial E3 2013 reveal of SSB4. Olimar's reveal also occurred one day before the Japanese release date of Pikmin 3. Olimar is currently ranked 30th out of 58 on the tier list, placing him at the top of the E tier. This is a significant drop from his top-tier placement in Brawl, where he was ranked 3rd out of 38. As in Super Smash Bros. Brawl, Olimar's Pikmin possess an impressive level of utility. The Pikmin grant him respectable KO and damage racking potentials, as Olimar can use them to deal direct and/or indirect damage via his standard moves or by having the Pikmin latch onto opponents via Pikmin Throw, respectively. The Pikmin also grant him a potent grab game, as they make each of his grabs disjointed and make his down throw a very reliable combo starter even up to high percents. Lastly, Winged Pikmin functions as a maneuverable, flight-based recovery move that is vastly superior to the tether-based recovery move Pikmin Chain and even allows Olimar to attack out of it. However, Olimar's active Pikmin count has now been halved from six to three, which severely weakens the camping strategies he relied on in Brawl. The Pikmin themselves have also been weakened in a few, yet noticeable ways: Red, Yellow, Blue and Purple Pikmin have lower hit points (which is further compounded by them and White Pikmin dying faster while separated from Olimar), while all types of Pikmin have lowered overall damage outputs and somewhat flawed artificial intelligence. Olimar himself retains his slow overall mobility, with his aerial mobility in particular making him easy to juggle despite him being a lightweight. Additionally, his offense is still burdened by slow attack speed and an over-reliance on Pikmin. Despite retaining his flaws and gaining new ones, Olimar has nevertheless attained decent representation in competitive play and has fared better than other characters that were formerly well-renowned in Brawl."
    },
    {
        "name": "R.O.B.",
        "picname": "R.O.B.",
        "tier": "D(28)",
        "bio": "R.O.B. (ロボット, Robot) is a playable character in Super Smash Bros. 4. His return to the series was officially confirmed on October 15th, 2014. R.O.B. reuses his mechanical sound effects from Super Smash Bros. Brawl as his 'voice', although they have been edited to sound quieter. R.O.B. is currently ranked 28th out of 58 on the tier list, placing him in the in D tier and being a slight improvement from his ranking of 18th out of 38 in Brawl. R.O.B. retains several of his strengths from Brawl: he has a strong zoning game courtesy of Robo Beam and Gyro, an excellent recovery courtesy of Robo Burner, a strong air game courtesy of all but one of his aerials having disjointed hitboxes, great mobility for a heavyweight, and a good grab game. In addition, R.O.B.'s once poor KOing ability has been significantly improved, due to him receiving a number of strong KOing options. However, R.O.B.'s ground game lacks range compared to his air game, which is most apparent with his grabs having the shortest ranges in the game. While it is still strong, his zoning game has also been somewhat toned down, as Robo Beam is slower and Gyro deals significantly less damage. Like in Brawl, R.O.B. also remains susceptible to combos due to his heavy weight and large size. Lastly, his newfound KOing options are hindered by considerable amounts of start-up lag. Overall, R.O.B. has become somewhat more viable competitively since Brawl, due to retaining many of his positive traits and having noticeably improved KOing ability. This has resulted in him achieving average tournament results overall and gaining a number of dedicated players to his credit."
    },
    {
        "name": "Sonic",
        "picname": "Sonic",
        "tier": "S(6)",
        "bio": "Sonic (ソニック, Sonic) is a playable character in Super Smash Bros. 4. His return to the series was announced during the Nintendo Direct on October 1st, 2013 to commemorate Sonic Lost World being released that month. Sonic is one of the six third-party characters in the game. He was the second third-party character to be revealed in the game, and is the first and only third-party veteran in the series. In the English version, Sonic is voiced by Roger Craig Smith, albeit via recycled voice clips from games such as Sonic Generations, and Sonic & All-Stars Racing Transformed. This reflects Smith's succession of Jason Griffith as Sonic's voice actor, who voiced Sonic from 2005 until 2010. Sonic also has alternate voices for the French, Spanish, German, and Italian versions, as Sonic the Hedgehog games from Sonic Generations onward were dubbed into those languages. However, the Japanese version simply recycles Jun'ichi Kanemaru's voice clips from Super Smash Bros. Brawl, who still voices Sonic in Japanese to this day. Sonic is currently ranked 6th out of 58 on the tier list, placing him in the S tier and making him the second highest ranked third-party character. This is a significant improvement over his mid-tier placement in Brawl, where he was ranked 22nd out of 38. True to his name, Sonic has the fastest dashing speed in the game, which grants him excellent mobility. His outstanding speed is complemented by his special moves, which allow him to attack while moving with little fear of reprisal. He also has capable KOing options in his forward smash, up smash, back aerial and up aerial. However, Sonic's KOing options are hindered by their high lag, which makes them risky. Despite his mobility, he does have trouble contending with projectile camping, while Spring Jump is a predictable recovery move due to its linearity. Overall, Sonic has retained his problematic knockback and lag issues, but his newfound KO potential and the retention of both his strong neutral game and outstanding mobility have resulted in him achieving a strong playerbase and consistent success in tournaments."
    },
    {
        "name": "Rosalina & Luma",
        "picname": "Rosalina_&_Luma",
        "tier": "S(4)",
        "bio": "Rosalina & Luma (ロゼッタ&チコ, Rosetta & Chiko), known simply as Rosalina (ロゼッタ, Rosetta) in the customization menu and the Super Smash Bros. for Nintendo 3DS foldout, are playable characters in Super Smash Bros. 4. A duo consisting of Rosalina and a Luma, the player primarily controls Rosalina, while additional moves and inputs control the Luma's position and attacks, which gives them a 'puppet fighter' playstyle. They were announced on December 18th, 2013 during a Nintendo Direct, which coincided with Rosalina's reveal in Mario Kart 8. Rosalina & Luma were the first newcomers announced after E3 2013, as well as the newest Mario representatives alongside Bowser Jr Rosalina's proportions are based upon her appearances in Super Mario Galaxy and Super Mario Galaxy 2, although her dress now sports star-shaped motifs and her high heels are now turquoise like her dress, rather than silver. Kerri Kane, who first voiced Rosalina in Mario Kart 7, reprises her role. Luma (チコ, Chiko) is a member of the star-shaped species of the same name that is under the care of Rosalina. It fights in tandem with Rosalina, similarly to how Nana fights in tandem with Popo. Unlike Nana, Luma is never controlled by the AI, even when separated from Rosalina. Rosalina is always accompanied by a yellow Luma at the beginning of each battle, and while the yellow Luma can respawn upon being KO'd, it is possible for a differently colored Luma to take its place. The other Lumas are colored blue, green, red, cream (who appears almost identical to Baby Luma), and dark brown (who is actually Polari). Rosalina & Luma are ranked 4th out of 58 on the tier list, placing them in the S tier and making them the second highest ranking newcomers. They are known for their strongly defensive neutral game, with the ability to invalidate projectiles using Gravitational Pull, Luma tanking hits for Rosalina while also being immune to status effects, and simply being very difficult to approach when together, as either character can cover the other and punish opponents when in danger. The duo also have impressive KO potential thanks to Luma's power and many of Rosalina's moves having disjointed ranges, while their respective moves are both quick and useful, such as Rosalina's up aerial having impressive juggling potential, and Luma's aerials boasting approach and combo potentials via Lunar Landing. Lastly, Launch Star is a useful recovery move, as it covers impressive distance and can be angled, thus making it capable of providing purely vertical, nearly horizontal, or diagonal recovery. However, Rosalina suffers from poor endurance due to her tall height and very light weight, while she has somewhat poor attack power and hitbox placements when Luma is KO'd. Despite its positives, Launch Star is linear and, due to lacking any hitboxes, unprotected. While Luma can be very difficult to KO, it can be very prone to being rendered inactive or KO'd outright due to it being unable to act out of a tumble until landing. Without Luma, Rosalina is less capable of defending against and especially defeating incoming threats for 13 seconds, after which Luma will respawn."
    },
    {
        "name": "Bowser Jr.",
        "picname": "Bowser_Jr.",
        "tier": "G(47)",
        "bio": "Bowser Jr. (クッパ Jr., Koopa Jr.) is a playable character in Super Smash Bros. 4. Bowser Jr. was officially revealed during the Super Smash Bros. for Wii U: 50-Fact Extravaganza on October 23, 2014, being the second-to-last newcomer shown by an official source. Prior to that, he was leaked by ESRB on August 29th. Bowser Jr. was also among the sixth wave of amiibo figures that are compatible with SSB4. Caety Sagoian reprises her role as Bowser Jr.'s voice actor, albeit via recycled voice clips from various Mario spin-off games. The Koopalings also use their voice clips from the New Super Mario Bros. games, which were voiced by Lani Minella (Larry, Morton, Wendy, and Lemmy), Mike Vaughn (Iggy and Ludwig) and Dan Falone. He has one of the best neutral games among the cast, with Clown Kart Dash acting as an excellent approach option and providing an impressive amount of versatility, while Mechakoopa is a very useful pressure option. Despite being a heavyweight, Bowser Jr. also sports a deceptively good air game, courtesy of his fairly fast aerial mobility and his aerial attacks' follow-up and juggle potentials. Unsurprisingly for a character that relies on weaponry over hand-to-hand combat, Bowser Jr. has disjointed hitboxes. However, this is especially noteworthy in his case, as he is the only character whose every attack is disjointed, which enables him to attack from a reasonably safe distance. To supplement this, many of Bowser Jr.'s attacks are powerful enough to KO under 100%. Despite his strengths, Bowser Jr. has noticeable flaws. His overall ground mobility is slow, which necessitates using Clown Kart Dash in order to keep up with faster opponents. Lag is another glaring issue; many of Bowser Jr.'s attacks have among the largest amounts of ending lag in the game, while his grab game suffers from his standing, pivot and dash grabs' overall lag. His grab game is further compounded by very unimpressive throws, with only his back throw being somewhat viable at best as a KOing option. Lastly, Bowser Jr.'s recovery can be problematic despite his good aerial mobility. This is due to Abandon Ship! offering no overhead protection and thus being very susceptible to gimps, as well as being unable to be re-used if he is hit by a weak attack."
    },
    {
        "name": "Greninja",
        "picname": "Greninja",
        "tier": "C(21)",
        "bio": "Greninja (ゲッコウガ, Gekkōga) is a playable character in Super Smash Bros. 4. It was revealed during the April 8th, 2014 Super Smash Bros. Direct, alongside fellow Pokémon representative Charizard. Greninja is voiced by Billy Bob Thompson in English and Yūji Ueda in Japanese. Like numerous other Pokémon, it has different voice actors in the French and German versions due to name changes, similarly to Jigglypuff. Greninja is currently ranked 21st out of 58 on the tier list, placing it in the C tier. Greninja's greatest strength is its overall mobility: its walking, dashing and air speeds and its jumps are each among the top 10 within their respective categories. These traits grant Greninja the distinction of being among the fastest characters in not just SSB4, but the entire series as well. It also has an impressive combo game courtesy of a number of moves, most notably its up and down tilts, its neutral and up aerials, and its down throw, all of which are decently fast. Its recovery is also above average, with Shadow Sneak being able to cover a noticeable amount of horizontal distance, while Hydro Pump is decently fast and maneuverable like Quick Attack. Greninja also boasts a decent projectile in Water Shuriken and a variable counterattack in Substitute. Water Shuriken functions as both a decent approach tool and boasts KO potential when fully charged against highly damaged opponents, while Substitute possesses combo, recovery and mindgame potential due to its unique ability to be aimed in various angles during the counterattack. Lastly, Greninja has some of the best smash attacks in regard to overall utility, with its up smash being one of the strongest in the game. Despite these strengths, Greninja has glaring flaws. One of them is the abnormally high ending lag on its attacks, particularly its smash attacks, which leaves it at a disadvantage against characters with attacks that have low ending lag. Its special moves also have some flaws, with Shadow Sneak and Hydro Pump being somewhat predictable recovery moves. Water Shuriken is easily blockable due to its low shield damage, and Substitute is considered to be one of the game's worst counterattacks due to its low power and ability to be blocked if the opponent is vigilant enough."
    },
    {
        "name": "Robin",
        "picname": "Robin",
        "tier": "E(31)",
        "bio": "Robin (ルフレ, Reflet) is a playable newcomer in Super Smash Bros. 4. He was confirmed during a live stream, alongside Lucina, on the official Super Smash Bros. website on July 14th, 2014. Like in his home game Fire Emblem Awakening, players can select either male and female versions of Robin, similarly to Corrin. In the English version, David Vincent, who is male Robin's first voice option in Awakening, reprises his role, while Lauren Landa voices female Robin. In the Japanese version, both Hosoya and Miyuki Sawashiro reprise their roles as the voice actors for the male Robin and the female Robin, respectively. Robin is ranked 31st out of 58 on the tier list, placing him in the E tier. Robin's tomes give him a strong zoning game: Thunder is a versatile projectile due to having varying effects at each level of charge, Arcfire is a strong tool for area denial and combo initiation, Elwind provides a highly damaging neutral infinite and is capable at edgeguarding due to being a strong meteor smash at point blank range, and Nosferatu is self-healing grab. Aside from his tomes' versatility, Robin also has high KO power courtesy of his Levin Sword. The Levin Sword deals considerably more knockback than his Bronze Sword while retaining the latter's relatively quick start-up, making it an extremely potent follow-up from his down throw. Finally, his depleted tomes and broken Levin Sword are powerful tactical items if tracked correctly, as they can be involved in advanced shield break combos and scoring KOs. However, Robin is burdened with poor mobility, which is most evident with his dashing speed being among the slowest in the game. He also suffers from a lackluster defensive presence due to lacking landing options and combo breaking options. While his back and down throws are useful due to their KO and combo potentials respectively, his grab game overall is hindered by his grab's short range and excessive amount of ending lag. Robin's disjointed range is also short for a weapon-based character, making long-ranged combat risky without use of his tomes. This is further compounded by his sword-based attacks, which are rather awkward swings that can prove difficult to land, with an infamous example being his up tilt."
    },
    {
        "name": "Lucina",
        "picname": "Lucina",
        "tier": "E(36)",
        "bio": "Lucina (ルキナ, Lucina) is a playable character in Super Smash Bros. 4. She was confirmed during a live stream alongside Robin on the official Super Smash Bros. website on July 14th, 2014, making her the only unlockable character to be revealed before SSB4's release. Laura Bailey and Yū Kobayashi reprise their roles as Lucina's English and Japanese voice actors, respectively. A clone of Marth, her ancestor within the Fire Emblem series, Lucina was originally planned as an alternate costume for him. However, she was given her own character slot later in development once her attacks were given differing traits. She was one of three intended alternate costumes to be made separate in this way. Lucina is currently ranked 36th out of 58 on the tier list, placing her at the bottom of the E tier and making her the lowest ranked mid-tier character. Like Marth, Lucina has good overall speed both on the ground and the air (including sharing the fastest walk speed in the game), giving her reliable control in her movement for both approaching and retreating. Lucina's Parallel Falchion also grants her an above-average disjointed range, many attacks with minimal start-up, useful combo options in the form of her neutral attack's first hit and Dancing Blade, and potent KOing options with her forward smash, up smash, back aerial and Shield Breaker. Finally, her lack of a tipper sweetspot makes her attacks less polarized than Marth's, which grants several benefits such as inflicting higher shieldstun at close range (which makes her slightly more difficult to punish out of shield compared to Marth's sourspotted attacks), and more consistent KO potential at high percentages. This also makes it easier for her to defend against pressure at close range. However, Lucina similarly shares Marth's flaws, including attacks that have considerable ending lag, a poor grab game, and Dolphin Slash being fairly easy to gimp due to its linearity. Additionally, her lack of a sweetspot is considered to be detrimental at high-level play; she lacks the extremely powerful tippers Marth can use to KO very early, while her strongest KO moves are weaker than Marth's optimally spaced tipper attacks. Furthermore, her higher overall knockback removes several noteworthy sourspot combos that Marth possesses at higher percents."
    },
    {
        "name": "Corrin",
        "picname": "Corrin",
        "tier": "C(18)",
        "bio": "Corrin (カムイ, Kamui) is a character and newcomer in Super Smash Bros. 4, and is the sixth downloadable character announced. - players can select either male and female variants of Corrin as in Fire Emblem Fates. In the Japanese version, the male and female Corrins are voiced by Nobunaga Shimazaki and Satomi Satō, respectively. In the English version, the male and female Corrins are voiced by Cam Clarke and Marcella Lentz-Pope, respectively. Corrin is currently ranked 18th in the tier list, putting him in the C tier. This makes him the highest-ranking Fire Emblem series character on the current tier list, and the second highest ranking low-high tier character. Corrin's best strength is his overall range, with his sword attacks having long/disjointed range, while his forward smash is notably the farthest-reaching of its kind. He also boasts relatively quick frame data, with many moves that come out on or before frame 10, and when given his range, it is relatively easy for him to land attacks. Corrin's combo game is also very effective due to being one of the only few characters whose all three tilt attacks have actual combo potential. His power is also respectable in its own right, with the tips on all of Corrin's smash attacks dealing very high knockback, while he also has a relatively capable damage racking game with his down aerial. Finally, Corrin has a unique approach move in Dragon Lunge, which allows him to stay in place, attack, or even trigger fakeouts. However, Corrin is held back by numerous flaws. One of his biggest problems is that, in vein to fellow Fire Emblem representative Marth, he often has trouble KO'ing at point blank range due to only the tips on his smash attacks having high knockback, and when given their low shield damage and high ending lag, he is easy to punish on shield. Another one of Corrin's flaws is his recovery; despite having one of the highest jumps and a recovery option in Dragon Ascent that is both fast and powerful, Corrin's recovery is only average at best (though it is extendable). Finally, Corrin's biggest flaw is his mobility, which is below average at best due to a slow dash and air speeds (though it is worth noting that Corrin also has a relatively high jump and fast walk speeds). In the end, Corrin's strengths outweigh his flaws despite the nerfs brought about by the 1.1.5 patch. Though Corrin is relatively new to the competitive Smash 4 scene, he has a few high-level players such as Cosmos, and Earth representing him, thus bringing him great tournament results with good matchups."
    },
    {
        "name": "Palutena",
        "picname": "Palutena",
        "tier": "F(40)",
        "bio": "Palutena (パルテナ, Palutena) is a playable character in Super Smash Bros. 4. She was confirmed alongside the Mii Fighters and Pac-Man during E3 2014 on June 10th, 2014. She is voiced in Japanese by Aya Hisakawa, who reprises her role from Kid Icarus: Uprising, and in English by Brandy Kopp, who replaced Ali Hillis due to availability conflicts.[1] Palutena is currently ranked 40th out of 58 on the tier list, placing her in the middle of the F tier. Palutena has good mobility overall, which is especially evident on the ground due to her fast walking and dashing speeds and high traction. She also possesses a useful set of aerial attacks, as well as a good combo game thanks to her jab cancel, aerials and down throw, the latter of which is further supplemented by her impressive grab range and excellent pummel. However, Palutena's weaknesses are quite glaring: her KOing options are difficult to land, her special moves have very low utility overall, and she has a predictable neutral game and a nonexistent approach due to having very sluggish frame data on most of her non-aerial attacks. Her tall size, below average weight, and high gravity also make her susceptible to combos, juggles and KOs. She does gain significant benefits from custom special moves that remedy her approaching issues and bolster her mobility, damage racking ability, and combo game, but since most tournaments disallow customs, she cannot make use of those advantages to improve her playstyle in the current metagame. As a result of these factors. Despite this, she still has some dedicated players to her credit, such as TLTC, Iceninja, and Prince Ramen, with the latter of the three scoring a major upset at CEO 2016 by defeating ZeRo 2-0 in pools. Additionally, her tournament results and representation have slowly improved since then."
    },
    {
        "name": "Dark Pit",
        "picname": "Dark_Pit",
        "tier": "",
        "bio": "Dark Pit (ブラックピット, Black Pit) is a playable character in Super Smash Bros. 4, being an unlockable newcomer. Dark Pit was teased before release, being shown in Palutena's reveal trailer, and officially confirmed by the Smash website on October 9th, in a post-release announcement. He is a moveset clone of Pit, was originally intended to be an alternate costume before being split off into his own character. Just as in Kid Icarus: Uprising, Dark Pit is voiced by Antony Del Rio in English and Minami Takayama in Japanese, sharing the same voice actors with Pit, albeit having mostly different voice clips. Dark Pit currently ranks 27th out of 58 characters on the tier list, in the D tier and three spots lower than Pit. While he is almost a full clone of Pit down to his movement options and combos, along with bearing a good damage racking ability, Dark Pit has a significantly more powerful KO option in Electroshock Arm, and a stronger (though less versatile) damage racking projectile in Silver Bow. However, as Dark Pit largely retains Pit's moveset, he suffers from the same issues as him, such as largely weak finishers that give him trouble taking stocks outside of aggressive edgeguarding, along with a weaker version of Pit's forward tilt. Regardless, he has the benefits of his aerials being able to autocancel out of a short hop, his recovery being long distanced, and his edgeguarding ability being effective thanks to his multiple jumps. Dark Pit's tournament representation was previously respectable, but after Nairo dropped him, his representation has become on par, if not slightly worse than Pit's already below average representation."
    },
    {
        "name": "Villager",
        "picname": "Villager",
        "tier": "B(14)",
        "bio": "Villager (むらびと, Villager) is a newcomer in Super Smash Bros. 4. Villager was revealed during E3 2013 on June 11th, 2013 during the first reveal trailer for Smash 4. There are four male and four female variations available. He was also among the first wave of amiibo figures that are compatible with SSB4. Villager is currently ranked 14th out of 58 characters in the official tier list, placing him in the middle of the B tier. Villager is arguably the best 'zoning' character in the game, able to outcamp opponents with his slingshot (forward and back aerials) and Lloid Rocket while countering opposing projectiles with Pocket and asserting large amounts of stage control with Timber. Additionally, he possesses an effective aerial moveset, a very reliable recovery, and a wealth of edgeguarding options, making him a terror offstage, as well as having very powerful KOing options for a middleweight. However, Villager lacks reliable KO setups despite his impressive power. He also has one of the slowest running speeds and a slow and rather punishable grab, limiting his ability to fight up close on the ground, and is quite vulnerable to reflectors due to his reliance on projectiles. Overall, though, Villager's stage control and edgeguarding options have allowed him to achieve very positive tournament results, especially in Japan (largely thanks to Ranai), and he is considered to be a viable high-tier character."
    },
    {
        "name": "Little Mac",
        "picname": "Little_Mac",
        "tier": "F(39)",
        "bio": "Little Mac (リトル・マック, Little Mac) is a playable character in Super Smash Bros. 4. He was revealed on February 13th, 2014 during a Nintendo Direct to commemorate the 30th anniversary of the Punch-Out!! series, which debuted in Japan in 1983, but later debuted in the West in 1984.[1] Instead of retaining Hisao Egawa, who voiced him as an Assist Trophy in Super Smash Bros. Brawl, or Matt Harty, who voiced him in the Wii version of Punch-Out!!, Little Mac is now voiced by Kōsuke Toriumi in all versions of SSB4. He also now sports his updated design from the Wii version of Punch-Out!!, rather than retaining the 3D version of his original design from the NES version of Punch-Out!! like he did as an Assist Trophy in Brawl. Little Mac is currently ranked 39th out of 58 in the tier list, placing him in the F tier. Little Mac has unarguably the best grounded attributes in the game: he possesses incredible grounded movement and dodging speeds, while his traction is among the highest in the game. These traits allow him to position himself quickly and effectively, while heavily complimenting his frame data while grounded, which is the fastest overall. Little Mac also possesses a surprisingly effective grounded combo game (with his neutral attack being one of the best in the game due to its high priority, combo potential, and speed), and a very reliable out of shield game due to the speed of his attacks (such as his neutral attack, tilt attacks, and Rising Uppercut). His neutral attack and tilts additionally benefit from anti-rebounding priority, allowing him to force opponents into clashing with his ground attacks while his own tilts go on uninterrupted. Little Mac is also notable for his array of finishers, which in turn grants him a very effective punishment game. Despite being a lightweight, his special moves are among the strongest of their kinds, while his smash attacks boast impressive speed, high power, and grant super armor from start to finish. Finally, his KO Uppercut is arguably the best comeback move in the series, and can be performed from multiple set-ups even at low percents."
    },
    {
        "name": "Wii Fit Trainer",
        "picname": "Wii_Fit_Trainer",
        "tier": "G(46/47)",
        "bio": "Wii Fit Trainer (Wii Fit トレーナー, Wii Fit Trainer) is a playable character in Super Smash Bros. 4. After initial reveal trailers, her status as a newcomer was revealed during E3 2013 on June 11th, 2013. She was one of the three newcomers announced at E3 2013. A male version of Wii Fit Trainer was shown on October 31st, 2013, the release date for the trial version of Wii Fit U,[1] and was later confirmed to be an alternate costume during the April 8th, 2014 Super Smash Bros. Direct. She was also among the first wave of amiibo figures compatible with SSB4. Unlike a majority of the characters, Wii Fit Trainer has different voice actors depending on the region and also because of being either female or male. In American English, female and male Wii Fit Trainers are voiced by October Moore and Steve Heinke, while Tania Emery and Luke Smith voice them in British English. In Japanese, they are voiced by Hitomi Hirose and Tomoyuki Higuchi. In French, they are voiced by Corinne Kempa and François Anseaume/Christophe Hespel, who provide dialogue and grunts, respectively. In American Spanish, they are voiced by Isabela Arevalo and Horacio Mancilla, while they are voiced by Pilar Orti and Javier Fernandez Peña in Spanish. In Italian, they are voiced by Lara Parmiani and Giovanni Loto. In German, they are voiced by Sylvia St. John and Michael Hulsmann. For the European Portuguese, Dutch and Russian versions of SSB4, their British English voices are used. Wii Fit Trainer's greatest strength is her impressive offense: she is able to quickly rack up damage and boasts a number of reliable finishers that can be strengthened by using Deep Breathing. She also has two useful projectiles in Sun Salutation and Header, a formidable approach thanks to her mobility, and attacks that have both minimal startup lag and decent combo potential. Wii Fit Trainer's recovery is also decent; Super Hoop grants above average distance when button mashed and its hoops can fend off point-blank edge-guarders, Header stalls her descent after its first use, her jumps are high and she is able to wall jump. Wii Fit Trainer also has mindgame potential due to a number of her attacks having hitboxes to the rear, along with unusual hitbox properties that are active at the same time as the primary hitbox, but with different knockback properties."
    },
    {
        "name": "Shulk",
        "picname": "Shulk",
        "tier": "G(44)",
        "bio": "Shulk (シュルク, Shulk) is a playable character in Super Smash Bros. 4. Shulk was officially confirmed on August 29th, 2014, the same day that Xenoblade Chronicles 3D, the New Nintendo 3DS port of his Wii debut title Xenoblade Chronicles, was announced. Additionally, he was the final character revealed prior to the release of Super Smash Bros. for Nintendo 3DS. Adam Howden and Shintarō Asanuma reprise their roles as Shulk's voice actors in the English and Japanese versions of SSB4, respectively. Shulk is currently ranked 44th out of 58 on the SSB4 tier list, placing him at the top of the G tier. Thanks to the Monado, he possesses the longest overall disjointed range of any character in the entire series. As a result, Shulk has one of the most effective movesets for spacing relative to the rest of the cast, which is most evident with his wide-ranged neutral and forward aerials, as well as long-ranged smash attacks that possess respectable overall damage outputs and KO potentials. The Monado also grants Shulk wide versatility thanks to its Monado Arts, which allow him to adapt his attributes to fit the situation while opening up opportunities that he would not have without them. This includes outstanding recovery with Jump, one of the best approach speeds with Speed, very high survivability with Shield, a very high overall damage output with Buster, and some of the strongest finishing moves in the game with Smash. In addition to their general benefits, Jump grants potent edgeguarding and aerial combo potentials, while Speed and Buster grant grounded combo potential. He also has one of the most effective counterattacks in Vision, which boasts high range and power along with one of the longest counterattack windows of its kind. However, Shulk is hindered by very sluggish frame data: almost none of his attacks come out within 5 frames (barring his neutral attack), and while his aerial attacks can be interrupted during their ending frames, all of his aerial attacks have extremely high ending lag and cannot autocancel in any way. This makes him highly prone to punishment and out of shield retaliation, and when combined with his tall stature, makes it difficult for him to avoid juggling."
    },
    {
        "name": "Duck Hunt",
        "picname": "Duck_Hunt",
        "tier": "F(42)",
        "bio": "Duck Hunt (ダックハント, Duck Hunt), rendered in-game as Duckhunt in the Japanese version and known as Duck Hunt Duo in the PAL version, are playable characters in Super Smash Bros. 4. Initially leaked as part of the ESRB leak prior to the release of Super Smash Bros. for Nintendo 3DS, Duck Hunt were formally revealed and received a trailer on November 5th, 2014 during a Nintendo Direct presentation. In addition to their titular game, Duck Hunt reference other NES light gun games by having special moves that use a metal can from Hogan's Alley and the gunmen from Wild Gunman. Duck Hunt are currently ranked 42nd out of 58 on the tier list, placing them in the F tier. Duck Hunt have a very capable zoning game thanks to three versatile projectiles, with the remote controllable Trick Shot being especially useful. They also possess a decent air game that enables them to edgeguard rather well, thanks to their attributes and aerial attacks. While Duck Hunt's ground attacks are not spectacular, they are generally capable of enabling them to fight in close quarters combat when necessary. However, Duck Hunt's most glaring flaw is their KO potential. Their smash attacks are particularly unreliable despite respectable overall damage outputs and knockback, multiple hit properties, and long ranges, while almost the entirety of their other moves generally have unimpressive knockback. As a result, Duck Hunt must rely on their sweetspotted neutral, up and sweetspotted back aerials alongside aggressive edgeguarding in order to score KOs. Duck Hunt's survivability is also unimpressive due to the problematic combination of them being among the lighter middleweights within the cast and their above average falling speed. This, in turn, is compounded by their recovery's overall mediocrity: while Duck Jump grants decent vertical distance and the dog is capable of wall jumping, Duck Jump grants minimal horizontal distance, is slow overall and leaves Duck Hunt unprotected. While Duck Hunt have low tournament representation due to their flaws, they have secured good results nonetheless, with players such as You3, Brood, Dandy Penguin, ImHip, and Raito achieving top 8 placings at regionals with them. As a result of Duck Hunt managing to achieve better results and develop a larger playerbase of dedicated mains compared to several characters that are considered much better than them, their tier placement has become debatable."
    },
    {
        "name": "Mega Man",
        "picname": "Mega_Man",
        "tier": "B(15)",
        "bio": "Mega Man (ロックマン, Rockman) is a newcomer in Super Smash Bros. 4. He was announced at Nintendo's E3 2013 Direct Conference presentation for the game. He does not widely use hand-to-hand combat, instead relying on the large arsenal of ranged weaponry he has amassed by defeating boss characters in his own games. His sound effects are reused from the vast number of retro Mega Man games he has appeared in. Mega Man currently ranks 15th on the SSB4 tier list, in B tier and in upper high tier. Mega Man's most prevalent advantage is that he has among the best projectile games in Smash 4, with his wide array of projectiles being able to keep opponents away. He excels in pressuring as a result, with his Crash Bomber able to pressure shields easily. This is made more effective once combined with Mega Man's grab game; his grabs are among the fastest in the game, with his down throw being a decent combo starter while his back throw is a decent option for racking up damage and KOing after 155%. His overall endurance is also above average, being the heaviest mediumweight with high falling speed; this allows him to take many vertical hits before being KOed, while also having a strong, long-distance recovery move in Rush Coil which does not leave him helpless. He also excels in racking up damage, with his dash attack, up smash, up aerial, back aerial and back throw being useful for inflicting high amounts of damage. Mega Man also boasts a surprising amount of raw power, as many of his attacks are among the strongest of their kind: he has the second strongest up tilt and third strongest down smash. Finally, Mega Man is tied for the highest air acceleration and possesses the highest air friction in the game, which grants him extremely fluid control in the air (including the ability to zig-zag while jumping).Overall, however, Mega Man is a strong contender in the Smash 4 metagame, although his high learning curve lends itself to a rather low amount of tournament representation compared to other high-tier characters. Mega Man also has plenty of results to back up his tier placement, with both Kameme placing 2nd at EVO 2016 and ScAtt placing 5th at Super Smash Con 2016 with him, the largest and third largest Smash 4 tournaments to date respectively. This has resulted in him having the third highest improvement from the first tier list to the second tier list, effectively going from the middle of the tier list to one of the most viable picks in competitive play."
    },
    {
        "name": "Pac-Man",
        "picname": "Pac-Man",
        "tier": "F(38)",
        "bio": "Pac-Man (パックマン, Pakkuman), rendered in-game as PACMAN in the Japanese version and as PAC-MAN in all other versions, is a newcomer in Super Smash Bros. 4. Initially revealed on June 10th, 2014 to attendees of the E3 2014 Smash Bros. Roundtable, he was later confirmed to the public on Nintendo of America's Twitter account[1]. Pac-Man is one of six third-party characters in SSB4, as well as the third third-party character revealed. Pac-Man's moveset involves signature aspects of his home series, such as throwing fruits and eating Power Pellets,[2] while also referencing numerous other Namco games in a few ways, most notably via his up taunt. While Pac-Man retains his classic 'wedge' form, he only uses it occasionally, such as for his down tilt and his side taunt. Instead, he mostly uses his 'ball' form that appeared on game cabinet artwork and advertising before it debuted in-game in the Japanese version of Pac-Land. Pac-Man is currently ranked 38th out of 58 on the tier list, placing him in the F tier. This makes him second highest ranking low-tier character and the lowest ranking third-party character. Pac-Man has possibly the most combat-effective projectile in Bonus Fruit, which can produce different kinds of effects depending on the used object, allowing for a myriad of set-ups, edgeguarding, or KO options. He additionally possess a very useful tool in Fire Hydrant due to its ability to punish enemies from below, work as an obstacle, function as a KO option, and even act as a combo breaker in the air or on the ground by stalling his descent and using the hydrant's water, respectively. This combines well with Pac-Man's effective damage racking potential, as his attacks' mostly fast speeds and low base knockback allow for combos or jab resets at low percentages. Pac-Man also boasts good recovery thanks to Power Pellet and Pac-Jump covering great distances alongside his ability to wall jump. However, Pac-Man is not without his flaws. His grounded mobility is only average at best, which gives him issues with approaching faster characters. Despite the aforementioned coverage Pac-Man's overall recovery possesses, it is quite predictable, slow and easily interruptible. His KO options are particularly lacking, due to his strongest ones (smash attacks) being hard to land and easily punishable, while they and his other options (clean neutral aerial, clean back aerial, Bonus Fruit's key and flying/tumbling Fire Hydrant) have low base knockback, making it very difficult for him to KO before his opponent gets to a significantly high percentage."
    },
    {
        "name": "Ryu",
        "picname": "Ryu",
        "tier": "A(9)",
        "bio": "Ryu (リュウ, Ryū) is a playable character and newcomer in Super Smash Bros. 4. As the fourth downloadable character announced. Ryu is the fourth of six playable third-party characters for the game. Ryu is voiced by Kyle Hebert in English and Hiroki Takahashi in Japanese, both of whom have voiced him since Street Fighter IV. Ryu is ranked 9th out of 58 on the tier list, placing him in the A tier. This makes him the second highest ranking downloadable character and the third highest-ranking third-party character in the current metagame. The control input carryover from the Street Fighter series benefits Ryu immensely, with his tapped attacks being useful combo starters and his held attacks being great combo finishers or potent KO options. This is made better by his multiple combo-breaking options such as Shoryuken, neutral air, and Focus Attack, all which have quick startup and make him surprisingly difficult to juggle, while the latter two also allow him to start damaging combos due to the good damage and speed of his moveset. His recovery is also resilient, as his entire special moveset grants him unpredictable ways to return to the stage. Finally, Ryu is exceedingly difficult to punish out of shield due to most of his moves having a hitlag multiplier of at least 1.8x. However, Ryu's approach is problematic due to his below-average mobility (with the exception of his average dashing speed). Most notably, he carries over the 'fixed arc' jumps from his series, giving him the lowest air acceleration in the game and making aerial approaches very committal. Additionally, his only projectile Hadoken is slow and very easily intercepted, while his ground attacks have short ranges. His grab game is also lackluster, since none of his throws can combo (barring down throw until 30%) or KO reliably. His recovery is also very easy to gimp if Shoryuken is his only available option, due to its fixed movement and inability to edge sweetspot until its later half. Finally, Ryu often suffers with 'forcing' KOs, as he lacks reliable finishing moves outside of setups from Focus Attack or his tapped tilts, making it difficult for him to take stocks without starting a combo."
    },
    {
        "name": "Cloud",
        "picname": "Cloud",
        "tier": "S(2)",
        "bio": "Cloud (クラウド, Cloud) is a playable character in Super Smash Bros. 4. He was officially announced during the November 12th, 2015 Nintendo Direct, and made available as downloadable content on December 15th, 2015. Cloud in all regions of Super Smash Bros. 4 is voiced only in Japanese by Takahiro Sakurai, his recurring Japanese voice actor from Final Fantasy VII: Advent Children onward, in spite of having Steve Burton as his English voice actor as of Advent Children. Cloud is currently ranked 2nd out of 58 on the tier list, placing him in the S tier. This makes him the highest ranking downloadable character, newcomer, and third-party character. When combined with his impressive movement speed, high jumps, the ability to wall jump, and surprisingly fast frame data relative to his range and overall power, Cloud is one of the most effective characters at spacing, approaching, and zoning. His aerials, combined with his air mobility, also grant him a particularly dangerous air game, as most of them are relatively safe on shield with proper spacing; back aerial possesses tremendous reach and decent damage output, and up aerial and down aerial are noteworthy for having large initial hitboxes, long-lasting lingering hitboxes, and very generous autocancel windows. Cloud also possesses a unique Limit Break mechanic, which, when fully charged either manually or by dealing and/or receiving damage, bolsters Cloud's maneuverability further and gives him more powerful, single-use versions of his special moves, making him one of the most dangerous characters in the game once he has reached Limit Break. However, Cloud does have notable drawbacks. His Limit Break mechanic makes his playstyle fluctuate constantly, as the gauge takes some time to charge. His recovery is notoriously weak without a full Limit Gauge despite his high second jump and decent air speed, due to Climhazzard's below average height gain, its inability to edge sweetspot like most up special moves and the fact he will get efficiently gimped if he gets hit by a powerful single hit blow at the apex of the move. Cloud's moveset is also inconsistent at KOing without the Limit Break specials or edgeguarding, with his more powerful attacks being risky to use due to their ending lag and his aerials requiring good positioning to KO effectively, especially off-stage, as he might not be able to get back if he goes too far off the stage."
    },
    {
        "name": "Bayonetta",
        "picname": "Bayonetta",
        "tier": "A(11)",
        "bio": "Bayonetta (ベヨネッタ, Bayonetta) is a character and newcomer in Super Smash Bros. 4, and is the seventh and final downloadable character. - Final Video Presentation on December 15th, 2015 and both were released on February 3rd, 2016. She is the sixth third party character to be introduced in SSB4. Bayonetta was added to the game as the winner of the Smash Bros. Fighter Ballot, being the highest-voted character in Europe and among the top 5 in North America, making her the overall #1 worldwide among realizable characters. Her appearance is based on her redesign for Bayonetta 2, but with slightly modified proportions, most notably in her height. Bayonetta's English voice actress, Hellena Taylor, and her Japanese voice actress, Atsuko Tanaka, both reprise their roles in Super Smash Bros. 4. Bayonetta currently ranks 11th out of 58 on the tier list, placing her at the bottom of A tier. This makes her the fourth highest ranked DLC character, newcomer, and third-party character. Being a combo-heavy character, her moves reliably chain into each other, leading to good 50/50 mixups at high percentages and even creating zero-to-death combos. Bayonetta has relatively good range and possesses decent zoning options in Bullet Climax and her unique Bullet Arts on almost all of her attacks. Her recovery is among the best in the game; it covers a significant distance, has directional flexibility, and possesses enormous hitboxes, rendering her virtually immune to edge-guards, while she herself is capable of edge-guarding many characters with her strong aerials and Witch Twist. Despite her fast faller status, Witch Time and Bat Within at the beginning of her dodges make it difficult to land a combo on her, as the slightest mistake could allow Bayonetta to intercept and even land a KO. However, her mobility and frame data are below average, making many of her attacks weak against shields, and her smash attacks are difficult to land without Witch Time activated, due to their low priority, slow startup, and even slower endlag. Bayonetta is lightweight and has a tall hurtbox, which makes her easier to KO than most characters. Bat Within is a double-edged sword, as it does not work on grabs, and to further compensate for its effect, Bayonetta's dodges have the longest overall animations of all characters and the most endlag after their intangibility frames. Finally, due to a recent nerf, her combos are not consistent enough to be a huge threat past high percents due to increased SDI modifiers, which further limits her reliable KO options."
    },
    {
        "name": "Mii Brawler",
        "picname": "Mii_Brawler",
        "tier": "H(54)",
        "bio": "Mii Brawlers (格闘タイプ, Hand-to-Hand Fighting Type) are one of the three different types of Mii Fighters that appear in Super Smash Bros. 4, along with Mii Swordfighters and Mii Gunners. The Mii Brawler is currently ranked 54th out of 58 characters in the current tier list. Mii Brawlers boast formidable mobility, attack speed, and damage that is further strengthened by their great ground and air games, giving them a versatile combo and KOing ability. However, Mii Brawlers also possess notable weaknesses: their overall range is poor relative to the cast and they have trouble approaching without Shot Put. Their grab game is subpar, with a short ranged grab and no reliable KO throws. The Brawler's recovery is also poor, with none of their special moves providing much upward distance and most of them being easy to gimp. Lastly, the universal ban of custom moves post-EVO 2015 (as well as ban of Miis) forces them to rely on their otherwise below-average special moveset, with Shot Put being a miserable projectile in general, Soaring Axe Kick not providing a good recovery, and Head-On Assault being considered its worst move, as it cannot KO (unless used as a meteor smash), can lead to a self-destruct, and is hard to land. As such, the Mii Brawler has very poor tournament representation, despite their decently high tournament results."
    },
    {
        "name": "Mii Swordfighter",
        "picname": "Mii_Swordfighter",
        "tier": "H(57)",
        "bio": "A Mii Swordfighter (剣術タイプ, Fencing Type), or Mii Sword Fighter in the PAL version, is one of the three different types of Mii Fighters that appear in Super Smash Bros. 4, along with Mii Brawlers and Mii Gunners. Mii Swordfighter is ranked 57th out of 58th on the current tier list, placing them in bottom tier and making them the lowest ranked newcomer and Mii Fighter. The Mii Swordfighter has several noteworthy strengths, such as solid range compared to most non-swordsmen, respectable combo ability, and one of the game's fastest grabs. When granted access to their custom moves, they also enjoy a slew of unique and flexible tools that make them an adaptable fighter, including access to three useful disrupting projectiles, along with being the only swordsman with access to a reflector in Reversal Slash. However, this versatility is made null by the banning of custom moves, and they are forced to contend with unimpressive mobility, surprisingly low KO power, and a laggy, unsafe moveset with a very poor approach. This fact is further pressed due to the Mii Swordfighter being outclassed by all other swordsmen in the game; they have less range than all others, below average ground movement (tied with Ike if using a default Mii), and less power than most. Because of this, the Mii Swordfighter is notoriously one of, if not the least popular character on the entire roster, with virtually no tournament results or dedicated mains to its credit, barring the few tournaments that allow customs. As such, some top players, most notably ZeRo, believe them to be the worst character in the game."
    },
    {
        "name": "Mii Gunner",
        "picname": "Mii_Gunner",
        "tier": "H(53)",
        "bio": "Mii Gunners (射撃タイプ, Shooting Type) are one of the three different types of Mii Fighters that appear in Super Smash Bros. 4, along with Mii Brawlers and Mii Swordfighters. The Mii Gunner is currently ranked 53rd out of 58 characters on the tier list, making them the highest ranking Mii fighter. Mii Gunner's positives include their fast attacks, wide range of projectiles making them very versatile in different situations, fast grab, and their superb range. However, they have some noticeable flaws. If using their default size and height, their mobility is very unimpressive. Also, despite being a long-ranged fighter, they have a surprisingly ironic lack of long-ranged KO options, with their strongest moves being effective at close range. Despite their fast grab, they have a very poor grab game, with their throws dealing very low damage, and being unable to combo or KO reliably. Their biggest flaw, however, is the banning of custom moves. Ever since EVO 2015 all custom moves have been banned, forcing Mii Gunners to resort to their default moveset, removing the versatility of their moveset. All of these flaws have landed the Mii Gunner in the bottom tier, and has resulted in very poor tournament representation, much like the two other Mii Fighters."
    }
    
]